{
  "backend/main.mo": "Main Motoko actor implementing a multi-coin wallet backend with transaction history, contacts, user profiles, and balance management for ICP, ckBTC, ckETH, ckSOL, and Infinity Coin, using access control authorization for all operations.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: displaying native blockchain receive addresses, adding transfer mode selector, handling native on-chain transfers, and updating transaction history to distinguish transfer types.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including React components, hooks, pages, utilities, and styling for the Infinity Wallet application with neon/futuristic theme and multi-chain support.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining colors for UI components, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point for the Infinity Wallet application with root div and module script reference to main.tsx.",
  "frontend/SMOKE_TEST.md": "Smoke test checklist covering seven primary user journeys: wallet connection, profile setup, dashboard render, navigation, send form, receive copy-to-clipboard, and contacts CRUD operations.",
  "frontend/src/App.tsx": "Root application component managing Internet Identity authentication flow, profile setup dialog, page routing, loading states, and error handling with theme provider and toast notifications.",
  "frontend/src/components/auth/AuthButton.tsx": "Authentication button component handling Internet Identity sign-in/sign-out with loading states, error recovery, and query cache clearing on logout.",
  "frontend/src/components/auth/PrincipalDisplay.tsx": "Displays the user's Internet Identity principal with optional truncation and a copy-to-clipboard button. Shows a styled card with the principal text and copy icon that changes to a checkmark on successful copy.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for first-time user profile setup that prompts for a name input. Cannot be dismissed and saves the profile using the useSaveCallerUserProfile hook.",
  "frontend/src/components/contacts/ContactEditorDialog.tsx": "Dialog component for adding or editing contacts with name and address fields. Validates recipient addresses and uses useSaveContact/useUpdateContact hooks to persist changes.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "React error boundary component that catches and displays application errors with a reload button. Shows error details in an expandable section and provides a full-page error UI.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with header, navigation bar, and content area. Provides navigation between dashboard, send, receive, contacts, history, and contracts pages with authenticated user controls.",
  "frontend/src/components/layout/WalletLogo.tsx": "Displays the application logo image with gradient text overlay and the app name. Uses branding constants and applies visual effects like shadows and gradients.",
  "frontend/src/components/wallet/BalanceCard.tsx": "Card component displaying a single token balance with icon, name, and refresh button. Handles loading, error states, and formats the balance with gradient styling.",
  "frontend/src/components/wallet/RecipientPicker.tsx": "Popover component with searchable contact list for selecting transaction recipients. Displays contact names and truncated addresses, calling onSelect callback when a contact is chosen.",
  "frontend/src/components/wallet/TotalAssetsDisplay.tsx": "Card showing total portfolio value with denomination currency selector (Infinity, ICP, ckBTC, ckETH, ckSOL). Currently displays balance in selected token without cross-token conversion.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor instance using Internet Identity authentication, initializing access control with an admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCkBtcBalance.ts": "React Query hook that fetches ckBTC balance from the ICRC-1 ledger for the authenticated user's default account with extensive console logging for debugging.",
  "frontend/src/hooks/useCkBtcLedger.ts": "React hook that initializes and manages an authenticated ckBTC ledger client, creating it when identity is available and logging detailed initialization steps.",
  "frontend/src/hooks/useCkEthBalance.ts": "React Query hook that fetches ckETH balance from the ICRC-1 ledger for the authenticated user's default account with extensive console logging for debugging.",
  "frontend/src/hooks/useCkEthLedger.ts": "React hook that initializes and manages an authenticated ckETH ledger client, creating it when identity is available and logging detailed initialization steps.",
  "frontend/src/hooks/useCkSolBalance.ts": "React Query hook that fetches ckSOL balance from the ICRC-1 ledger for the authenticated user's default account with extensive console logging for debugging.",
  "frontend/src/hooks/useCkSolLedger.ts": "React hook that initializes and manages an authenticated ckSOL ledger client, creating it when identity is available and logging detailed initialization steps.",
  "frontend/src/hooks/useIcpBalance.ts": "React Query hook that fetches ICP balance from the ICRC-1 ledger for the authenticated user's default account with extensive console logging for debugging.",
  "frontend/src/hooks/useIcpLedger.ts": "React hook that creates and manages an authenticated ICP ledger client using Internet Identity, with comprehensive console logging for debugging initialization and actor method verification.",
  "frontend/src/hooks/useInfinityCoinBalance.ts": "React Query hook that fetches Infinity Coin balance from the ICRC-1 ledger for the authenticated user, with detailed logging of account construction and balance retrieval.",
  "frontend/src/hooks/useInfinityLedger.ts": "React hook that creates and manages an authenticated Infinity Coin ledger client using Internet Identity, with comprehensive debugging logs for initialization and method verification.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status with configurable AuthClient options.",
  "frontend/src/hooks/useOisyActor.ts": "Empty file with no content.",
  "frontend/src/hooks/useOisyWallet.tsx": "Empty file with no content.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user profiles, transaction history, and contacts management, providing CRUD operations with automatic cache invalidation and toast notifications.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light/dark cosmic theme featuring neon cyan, purple, and magenta accents, plus glow utilities and animated starfield background.",
  "frontend/src/lib/branding.ts": "Constants defining application name and supported token symbols (ICP, ckBTC, ckETH, ckSOL, Infinity Coin).",
  "frontend/src/lib/ckBtcLedger/client.ts": "Implements ICRC-1 client for ckBTC ledger with types, IDL factory, and createCkBtcLedgerClient function that creates an authenticated actor with debugging logs and root key fetching for local development.",
  "frontend/src/lib/ckBtcLedger/config.ts": "Exports the ckBTC ledger canister ID constant 'mxzaz-hqaaa-aaaar-qaada-cai'.",
  "frontend/src/lib/ckBtcLedger/index.ts": "Re-exports ckBTC ledger configuration, client functions, and TypeScript types for external consumption.",
  "frontend/src/lib/ckEthLedger/client.ts": "Implements ICRC-1 client for ckETH ledger with types, IDL factory, and createCkEthLedgerClient function that creates an authenticated actor with debugging logs and root key fetching for local development.",
  "frontend/src/lib/ckEthLedger/config.ts": "Exports the ckETH ledger canister ID constant 'ss2fx-dyaaa-aaaar-qacoq-cai'.",
  "frontend/src/lib/ckEthLedger/index.ts": "Re-exports ckETH ledger configuration, client functions, and TypeScript types for external consumption.",
  "frontend/src/lib/ckSolLedger/client.ts": "Implements ICRC-1 client for ckSOL ledger with types, IDL factory, and createCkSolLedgerClient function that creates an authenticated actor with debugging logs and root key fetching for local development.",
  "frontend/src/lib/ckSolLedger/config.ts": "Exports the ckSOL ledger canister ID constant 'zfcdd-tqaaa-aaaaq-aaaga-cai'.",
  "frontend/src/lib/ckSolLedger/index.ts": "Re-exports ckSOL ledger configuration, client functions, and TypeScript types for external consumption.",
  "frontend/src/lib/icpAccountId.ts": "Provides principalToAccountId function that derives ICP Ledger Account Identifier from a Principal using SHA-224 hashing and CRC32 checksum, with custom implementations of both algorithms.",
  "frontend/src/lib/icpLedger/client.ts": "Implements ICRC-1 client for ICP ledger with types, IDL factory, and createIcpLedgerClient function that creates an authenticated actor with debugging logs and root key fetching for local development.",
  "frontend/src/lib/icpLedger/config.ts": "Exports the ICP ledger canister ID constant 'ryjl3-tyaaa-aaaaa-aaaba-cai'.",
  "frontend/src/lib/icpLedger/index.ts": "Re-exports ICP ledger configuration, client functions, and TypeScript types for external consumption.",
  "frontend/src/lib/infinityLedger/client.ts": "Defines ICRC-1 ledger types and interfaces, provides an IDL factory for the Infinity Coin ledger, and exports a function to create an authenticated ledger client with comprehensive debugging.",
  "frontend/src/lib/infinityLedger/config.ts": "Exports the Infinity Coin ICRC-1 ledger canister ID as a single source of truth.",
  "frontend/src/lib/infinityLedger/index.ts": "Re-exports the Infinity Coin ledger configuration, client creation functions, and TypeScript types for external use.",
  "frontend/src/lib/utils.ts": "Provides utility functions for CSS class merging, truncating principal strings, and formatting timestamps.",
  "frontend/src/lib/validation.ts": "Contains validation functions for recipient addresses (ICP/Principal), Bitcoin, Ethereum, Solana addresses, and amount parsing/formatting utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/ContactsPage.tsx": "Displays a contact management page with add, edit, and delete functionality using custom hooks and dialog components.",
  "frontend/src/pages/ContractsPage.tsx": "Provides a UI for calling canister methods with Internet Identity authentication, currently simulating contract calls as a demo implementation.",
  "frontend/src/pages/DashboardPage.tsx": "Displays wallet dashboard with total assets and individual token balances for Infinity Coin, ICP, ckBTC, ckETH, and ckSOL using custom balance hooks.",
  "frontend/src/pages/HistoryPage.tsx": "Displays transaction history with filtering by token type, showing locally recorded transaction submissions with warnings that actual balances are controlled by ICRC-1 ledgers. Includes refresh functionality and uses token icons/labels for different coin types (INFINITY, ICP, ckBTC, ckETH, ckSOL).",
  "frontend/src/pages/ReceivePage.tsx": "Shows user's Principal address for receiving ICRC-1 tokens and chain-specific addresses (BTC, ETH, SOL) for native deposits. Displays unified addressing for all supported tokens with copy-to-clipboard functionality and loading states for chain-key addresses.",
  "frontend/src/pages/SendPage.tsx": "Multi-step token sending interface supporting both wrapped ICRC-1 transfers and native chain transfers (BTC, ETH, SOL). Handles validation, confirmation, and execution of transfers across multiple ledgers with error handling and transaction recording.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and persisting URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, glow/neon shadow effects, cosmic gradient backgrounds, and extended theme including typography, container queries, and animations.",
  "project_state.json": "Project state tracking for a multi-chain Web3 wallet supporting BTC, ETH, and SOL with both wrapped token transfers (fast/cheap) and native on-chain conversions via chain-key integration. Contains existing features for displaying receive addresses and transfer mode selection, plus pending feature requests for generating unique addresses and implementing native coin conversion methods."
}