{
  "backend/main.mo": "Motoko canister managing user profiles, contacts, and transaction history with access‑controlled queries and updates.",
  "feature_evidence.json": "Feature evidence report mapping UI theme and branding updates to affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files describing their roles in the UI and theme.",
  "frontend/index.css": "Tailwind base/theme variable definitions providing color tokens and dark‑mode values.",
  "frontend/index.html": "Basic HTML shell loading the React app entry point.",
  "frontend/src/App.tsx": "Main React app handling auth, profile setup, routing, and layout rendering.",
  "frontend/src/components/auth/AuthButton.tsx": "Login/logout button integrating Internet Identity authentication.",
  "frontend/src/components/auth/PrincipalDisplay.tsx": "Displays and allows copying of the authenticated user's principal.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for initial user profile creation with name entry.",
  "frontend/src/components/contacts/ContactEditorDialog.tsx": "Dialog for creating or editing contacts with validation and backend mutations.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout component with header, navigation, and content areas, handling auth state and page navigation.",
  "frontend/src/components/layout/WalletLogo.tsx": "Renders the app logo and name with styled visuals.",
  "frontend/src/components/wallet/RecipientPicker.tsx": "Popover contact picker that lets users search and select saved contacts as transaction recipients.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, managing login, logout, stored identities, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating profiles, balances, transactions, and contacts through the actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark themes and custom neon-style UI effects.",
  "frontend/src/lib/branding.ts": "Defines app branding constants like app name and token labels.",
  "frontend/src/lib/utils.ts": "Utility functions for class merging, principal truncation, and timestamp formatting.",
  "frontend/src/lib/validation.ts": "Validation helpers for recipients and amounts, plus balance formatting and amount parsing.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/ContactsPage.tsx": "Displays and manages contacts with add, edit, and delete actions using dialogs and query hooks.",
  "frontend/src/pages/DashboardPage.tsx": "Shows ICP and Infinity token balances with loading, error handling, and a manual refresh option.",
  "frontend/src/pages/HistoryPage.tsx": "Fetches and filters locally stored transaction history with tabs, loading states, and refresh capability.",
  "frontend/src/pages/SendPage.tsx": "Handles sending assets through a multi‑step form with validation, confirmation, and success flow.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, retrieving, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended colors based on CSS variables, custom radii, fonts, shadows, and background gradients, and includes typography, container queries, and animation plugins.",
  "project_state.json": "Defines project metadata, features, and requirements for building the Infinity Wallet app, including branding, authentication, wallet functions, theming, and image asset needs."
}