{
  "backend/main.mo": "Motoko canister implementing user profiles, contacts, and transaction history with access control and basic CRUD operations.",
  "feature_evidence.json": "Metadata describing features, related files, components, and test IDs for deployment rollback and smoke testing.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files detailing their purpose and functionality.",
  "frontend/index.css": "Global Tailwind-based theme definitions using OKLCH colors with dark mode tokens and base styling.",
  "frontend/index.html": "HTML entry point loading the React application from main.tsx.",
  "frontend/SMOKE_TEST.md": "Checklist for validating core user flows including connection, navigation, send/receive, contacts, and contracts.",
  "frontend/src/App.tsx": "Root React component handling Oisy authentication, profile setup, routing, and global layout with error boundaries.",
  "frontend/src/components/auth/AuthButton.tsx": "Button component managing Oisy wallet connect and disconnect with loading states.",
  "frontend/src/components/auth/PrincipalDisplay.tsx": "Displays the connected principal with copy-to-clipboard functionality and truncated formatting.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog that collects a user's name and saves it using a profile mutation.",
  "frontend/src/components/contacts/ContactEditorDialog.tsx": "Dialog for creating or editing a contact with validation and save/update mutations.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "React error boundary that displays an error alert and allows reloading the app.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout with header, navigation, and page switching based on current view.",
  "frontend/src/components/layout/WalletLogo.tsx": "Displays the app logo and styled brand name.",
  "frontend/src/components/wallet/RecipientPicker.tsx": "Popover picker that lists contacts and lets the user select a recipient address.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, invalidating queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, stored identity, and login state.",
  "frontend/src/hooks/useOisyActor.ts": "Creates a backend actor using the Oisy wallet identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useOisyWallet.tsx": "Provides a React context and mock implementation for connecting to an Oisy wallet, managing identity and connection state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, balances, transactions, and contacts via an Oisy actor.",
  "frontend/src/index.css": "Sets global Tailwind styles and theme variables, including light/dark modes and custom cosmic visual effects.",
  "frontend/src/lib/branding.ts": "Exports basic branding constants such as app and token names.",
  "frontend/src/lib/icpAccountId.ts": "Implements ICP account ID derivation from a principal, including SHA‑224 and CRC32 logic.",
  "frontend/src/lib/utils.ts": "Provides utility helpers for class merging, principal truncation, and timestamp formatting.",
  "frontend/src/lib/validation.ts": "Includes validation utilities for recipient addresses and amounts, plus balance formatting and amount parsing.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/ContactsPage.tsx": "Renders the contacts management page with list display, add/edit dialogs, and delete confirmation.",
  "frontend/src/pages/ContractsPage.tsx": "Provides a UI to simulate calling canister methods via Oisy Wallet, handling form input, validation, and mock responses.",
  "frontend/src/pages/DashboardPage.tsx": "Displays wallet balances and quick actions, with refresh support and Infinity Coin balance rendering.",
  "frontend/src/pages/HistoryPage.tsx": "Shows locally stored transaction history with refresh, loading states, and formatted transaction details.",
  "frontend/src/pages/ReceivePage.tsx": "Displays the user's principal address and allows copying it when the Oisy Wallet is connected.",
  "frontend/src/pages/SendPage.tsx": "Implements a multi-step send flow for Infinity Coin, including validation, confirmation, and recording transactions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, shadows, gradients, and plugins for a themed UI with container settings and extended utilities.",
  "project_state.json": "Defines the project’s current state, goals, known issues, and features, focusing on integrating Oisy Wallet and supporting Infinity Wallet functionality."
}