{
  "backend/main.mo": "Main Motoko canister implementing user profiles, contacts, and transaction history with authorization checks and in-memory storage.",
  "backend/migration.mo": "Defines migration types and a no-op migration function returning old state unchanged.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of frontend source files for reference in build planning.",
  "frontend/index.css": "Tailwind-based global stylesheet defining color variables and base styling for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point loading the React application via main.tsx.",
  "frontend/SMOKE_TEST.md": "Smoke test checklist describing core user flows to verify after deployment.",
  "frontend/src/App.tsx": "Main app component handling authentication states, profile loading, routing, and page rendering within the layout.",
  "frontend/src/components/auth/AuthButton.tsx": "Provides a sign-in/sign-out button tied to Internet Identity with login state handling.",
  "frontend/src/components/auth/PrincipalDisplay.tsx": "Displays the user's principal with optional truncation and a copy-to-clipboard button.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog prompting new users to enter and save their profile name.",
  "frontend/src/components/contacts/ContactEditorDialog.tsx": "Dialog for adding or editing a contact with validation and save/update mutations.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "Error boundary component that catches UI errors and shows a reload option.",
  "frontend/src/components/layout/AppLayout.tsx": "Application layout with header, authentication controls, navigation, and page container.",
  "frontend/src/components/layout/WalletLogo.tsx": "Renders the wallet logo and app name using branding constants.",
  "frontend/src/components/wallet/RecipientPicker.tsx": "Popover-based contact picker allowing users to select a saved contact as a recipient.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, invalidating dependent queries on changes.",
  "frontend/src/hooks/useInfinityCoinBalance.ts": "Fetches the user's Infinity Coin balance using react-query and an authenticated ledger client.",
  "frontend/src/hooks/useInfinityLedger.ts": "Initializes and exposes an authenticated Infinity Ledger client based on the user's Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout actions, and an Identity context provider.",
  "frontend/src/hooks/useOisyActor.ts": "Empty placeholder file.",
  "frontend/src/hooks/useOisyWallet.tsx": "Empty placeholder file.",
  "frontend/src/hooks/useQueries.ts": "React-query hooks for user profiles, contacts, and transaction history using a backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light/dark themes with a cosmic aesthetic.",
  "frontend/src/lib/branding.ts": "Exports application and token name constants.",
  "frontend/src/lib/icpAccountId.ts": "Implements derivation of ICP account IDs from principals using SHA-224 and CRC32.",
  "frontend/src/lib/infinityLedger/client.ts": "Defines ICRC-1 ledger client types, IDL, and a function to create an authenticated Infinity Ledger actor.",
  "frontend/src/lib/infinityLedger/config.ts": "Stores the Infinity Coin ledger canister ID.",
  "frontend/src/lib/infinityLedger/index.ts": "Re-exports Infinity Ledger client utilities and types.",
  "frontend/src/lib/utils.ts": "Utility functions for class merging, principal truncation, and timestamp formatting.",
  "frontend/src/lib/validation.ts": "Provides validation for recipients and amounts, plus helpers to format balances and convert amounts to e8s.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/ContactsPage.tsx": "Loads, displays, creates, edits, and deletes saved contacts with UI dialogs and error/loading states.",
  "frontend/src/pages/ContractsPage.tsx": "Allows authenticated users to simulate canister method calls with JSON arguments and displays results.",
  "frontend/src/pages/DashboardPage.tsx": "Shows the user’s Infinity Coin balance and provides quick navigation actions.",
  "frontend/src/pages/HistoryPage.tsx": "Displays locally recorded transaction history with loading, error, and refresh handling.",
  "frontend/src/pages/ReceivePage.tsx": "Shows the user’s principal for receiving Infinity Coin and supports copying it to the clipboard.",
  "frontend/src/pages/SendPage.tsx": "Implements the Infinity Coin send flow with validation, transfer execution via the ICRC-1 ledger, and UI step handling.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from the URL.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, shadows, and plugin setup.",
  "project_state.json": "Describes the project’s ledger-integration state, requirements, and existing features for Infinity Coin ICRC-1 support."
}