{
  "backend/main.mo": "Main backend actor implementing a multi-coin wallet with transaction history, contacts, user profiles, and access control using MixinAuthorization. Supports ICP, ckBTC, ckETH, ckSOL, and infinityCoin with balance tracking, transaction recording with block heights, and CRUD operations for contacts.",
  "feature_evidence.json": "Feature evidence report documenting a ckBTC deposit status decoding error ('Not a vector type') in the useCkBtcDepositStatus hook, with high confidence and references to multiple components including authorization, core-infrastructure, and http-outcalls.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including authentication flow, query hooks, validation utilities with 12-decimal precision for small values, dashboard with USD conversion, send flow with ckBTC native withdrawal support, and neon-themed UI components with glassmorphic styling.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color variables for light and dark themes, defining design tokens for background, foreground, card, primary, secondary, muted, accent, destructive, border, input, ring, chart colors, and sidebar variants.",
  "frontend/index.html": "HTML entry point for Infinity Wallet with viewport meta tag and module script loading main.tsx.",
  "frontend/SMOKE_TEST.md": "Smoke test checklist covering connection flow, profile setup, dashboard rendering, navigation, send form with ICP Account ID and Principal validation, receive page copy-to-clipboard, and contacts CRUD operations.",
  "frontend/src/App.tsx": "Main app component managing Internet Identity authentication states (isInitializing, isLoggingIn, isLoginError), profile setup dialog, page routing between dashboard/send/contacts/history/receive/contracts, and error boundary with loading and error UI.",
  "frontend/src/components/auth/AuthButton.tsx": "Authentication button component handling Internet Identity login/logout with loading states, query cache clearing on logout, and error recovery for duplicate authentication attempts.",
  "frontend/src/components/auth/PrincipalDisplay.tsx": "Component displaying user's principal with optional truncation and copy-to-clipboard functionality, styled with neon border and glow effects.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for new users to enter their name during initial profile setup. Prevents closing until name is submitted.",
  "frontend/src/components/contacts/ContactEditorDialog.tsx": "Dialog component for adding or editing contacts with name and address fields, including validation for ICP addresses and principals.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "React error boundary component that catches and displays application errors with a reload button and error details.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with header, navigation bar, and page routing for dashboard, send, receive, contacts, history, and contracts pages.",
  "frontend/src/components/layout/WalletLogo.tsx": "Displays the Infinity Wallet logo image with gradient text branding and glow effects.",
  "frontend/src/components/wallet/BalanceCard.tsx": "Card component displaying token balance with icon, USD value, loading states, error handling, and manual refresh button.",
  "frontend/src/components/wallet/BitcoinDepositStatus.tsx": "Alert component that displays pending Bitcoin deposit status with refresh functionality when ckBTC minting is in progress.",
  "frontend/src/components/wallet/BitcoinFeeDisplay.tsx": "Alert component showing Bitcoin network fee in satoshis and BTC with processing time information for ckBTC withdrawals.",
  "frontend/src/components/wallet/RecipientPicker.tsx": "Popover component with searchable contact list for selecting recipient addresses from saved contacts.",
  "frontend/src/components/wallet/TotalAssetsDisplay.tsx": "Displays total wallet assets across multiple tokens (Infinity Coin, ICP, ckBTC, ckETH, ckSOL) with USD value calculation and denomination currency selector.",
  "frontend/src/components/wallet/TransferModeSelector.tsx": "Radio group component for selecting between wrapped ICRC-1 token transfers (fast, cheap) and native Bitcoin withdrawals (slower, network fees).",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor with authentication, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useCkBtcBalance.ts": "Fetches ckBTC balance from the ICRC-1 ledger using the authenticated user's principal with comprehensive debug logging.",
  "frontend/src/hooks/useCkBtcDepositAddress.ts": "Queries the ckBTC minter to get the user's Bitcoin deposit address, handling mainnet-only availability gracefully.",
  "frontend/src/hooks/useCkBtcDepositStatus.ts": "Polls the ckBTC minter for pending Bitcoin deposits and UTXO status, returning confirmation counts and minting state.",
  "frontend/src/hooks/useCkBtcLedger.ts": "Creates and manages an authenticated ckBTC ICRC-1 ledger client actor, initializing on identity changes with detailed logging.",
  "frontend/src/hooks/useCkBtcMinter.ts": "Creates and manages a ckBTC minter client actor for Bitcoin deposit/withdrawal operations, initializing when identity is available.",
  "frontend/src/hooks/useCkBtcMinterInfo.ts": "Queries static minter configuration information (fees, limits, etc.) with 5-minute cache.",
  "frontend/src/hooks/useCkBtcWithdraw.ts": "Mutation hook for withdrawing ckBTC to native Bitcoin addresses via the minter, invalidating balance and transaction queries on success.",
  "frontend/src/hooks/useCkBtcWithdrawalStatus.ts": "React Query hook that polls ckBTC withdrawal status by block index every 10 seconds until confirmed, using the ckBTC minter client.",
  "frontend/src/hooks/useCkEthBalance.ts": "React Query hook that fetches ckETH balance from the ICRC-1 ledger for the authenticated user's default account with extensive debug logging.",
  "frontend/src/hooks/useCkEthLedger.ts": "React hook that initializes and manages an authenticated ckETH ICRC-1 ledger client, creating it when identity is available and clearing it on logout.",
  "frontend/src/hooks/useCkSolBalance.ts": "React Query hook that fetches ckSOL balance from the ICRC-1 ledger for the authenticated user's default account with extensive debug logging.",
  "frontend/src/hooks/useCkSolLedger.ts": "React hook that initializes and manages an authenticated ckSOL ICRC-1 ledger client, creating it when identity is available and clearing it on logout.",
  "frontend/src/hooks/useExchangeRates.ts": "React Query hook that fetches cryptocurrency exchange rates from ICPSwap API via backend actor, parsing ICP/USD direct rates and converting ICP-denominated rates (ckBTC, ckETH, ckSOL, Infinity Coin) to USD.",
  "frontend/src/hooks/useIcpBalance.ts": "React Query hook that fetches ICP balance from the ICRC-1 ledger for the authenticated user's default account with extensive debug logging.",
  "frontend/src/hooks/useIcpLedger.ts": "React hook that initializes and manages an authenticated ICP ICRC-1 ledger client, creating it when identity is available and clearing it on logout.",
  "frontend/src/hooks/useInfinityCoinBalance.ts": "React Query hook that fetches the Infinity Coin balance from the ICRC-1 ledger with extensive console logging for debugging identity, account construction, and balance fetch operations.",
  "frontend/src/hooks/useInfinityLedger.ts": "React hook that initializes and manages an authenticated Infinity Coin ledger client, creating the client when identity is available and logging initialization steps and actor method verification.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useOisyActor.ts": "Empty file with no content.",
  "frontend/src/hooks/useOisyWallet.tsx": "Empty file with no content.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend operations including user profiles, transaction history, and contacts management with mutations that invalidate queries and show toast notifications.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light/dark cosmic theme, neon glow utilities (cyan, purple, magenta), and animated starfield background effects.",
  "frontend/src/lib/branding.ts": "Exports application branding constants including app name and supported token symbols (ICP, ckBTC, ckETH, ckSOL, Infinity Coin).",
  "frontend/src/lib/ckBtcLedger/client.ts": "Creates authenticated ICRC-1 ckBTC ledger client with TypeScript types and IDL factory for balance queries, transfers, and metadata operations with comprehensive debug logging.",
  "frontend/src/lib/ckBtcLedger/config.ts": "Exports the ckBTC ICRC-1 ledger canister ID constant as the single source of truth.",
  "frontend/src/lib/ckBtcLedger/index.ts": "Re-exports ckBTC ledger configuration, client creation function, utility functions, and TypeScript types from the ckBtcLedger module.",
  "frontend/src/lib/ckBtcMinter/client.ts": "Defines TypeScript types and IDL factory for the ckBTC minter canister, providing interfaces for Bitcoin address generation, balance updates, BTC retrieval, and minter info queries.",
  "frontend/src/lib/ckBtcMinter/config.ts": "Exports the official ckBTC minter canister ID for mainnet.",
  "frontend/src/lib/ckBtcMinter/index.ts": "Re-exports all configuration and client functionality from the ckBtcMinter module.",
  "frontend/src/lib/ckEthLedger/client.ts": "Implements ICRC-1 ledger client for ckETH with comprehensive debugging, providing balance queries, transfers, and metadata functions using the Dfinity agent.",
  "frontend/src/lib/ckEthLedger/config.ts": "Exports the ckETH ICRC-1 ledger canister ID as the single source of truth.",
  "frontend/src/lib/ckEthLedger/index.ts": "Re-exports ckETH ledger configuration, client creation functions, and ICRC-1 types.",
  "frontend/src/lib/ckSolLedger/client.ts": "Implements ICRC-1 ledger client for ckSOL with debugging support, mirroring the ckETH client structure for balance queries, transfers, and metadata.",
  "frontend/src/lib/ckSolLedger/config.ts": "Exports the ckSOL ICRC-1 ledger canister ID as the single source of truth.",
  "frontend/src/lib/ckSolLedger/index.ts": "Re-exports ckSOL ledger configuration, client creation functions, and ICRC-1 types.",
  "frontend/src/lib/icpAccountId.ts": "Provides utility functions to derive ICP Ledger Account Identifiers from Principals using SHA-224 hashing and CRC32 checksums.",
  "frontend/src/lib/icpLedger/client.ts": "Implements ICRC-1 ledger client for ICP with debugging support, providing balance queries, transfers, fee queries, and metadata functions.",
  "frontend/src/lib/icpLedger/config.ts": "Exports the ICP ICRC-1 ledger canister ID as the single source of truth.",
  "frontend/src/lib/icpLedger/index.ts": "Re-exports ICP ledger configuration, client creation functions, and ICRC-1 types.",
  "frontend/src/lib/infinityLedger/client.ts": "Defines ICRC-1 ledger client for Infinity Coin with types for accounts, transfers, and errors. Exports createInfinityLedgerClient function that creates an authenticated actor using @dfinity/agent with comprehensive debugging and IDL factory.",
  "frontend/src/lib/infinityLedger/config.ts": "Exports the Infinity Coin ICRC-1 ledger canister ID constant (atuk3-uqaaa-aaaam-qduwa-cai) as the single source of truth.",
  "frontend/src/lib/infinityLedger/index.ts": "Re-exports all Infinity Coin ledger types, functions, and configuration from client.ts and config.ts as the main module entry point.",
  "frontend/src/lib/utils.ts": "Provides utility functions: cn for merging Tailwind classes, truncatePrincipal for shortening principal strings, and formatTimestamp for converting bigint timestamps to readable dates.",
  "frontend/src/lib/validation.ts": "Contains validation functions for cryptocurrency addresses (ICP, Bitcoin, Ethereum, Solana) and amounts, plus utilities for parsing amounts to e8s format and formatting balances.",
  "frontend/src/main.tsx": "Application entry point that renders the root component with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/ContactsPage.tsx": "Displays and manages saved contacts with add, edit, and delete functionality using custom hooks (useGetContacts, useDeleteContact) and a ContactEditorDialog component.",
  "frontend/src/pages/ContractsPage.tsx": "Provides UI for calling canister methods with authentication check, form inputs for canister ID, method name, and JSON arguments, currently simulating contract calls as a demo.",
  "frontend/src/pages/DashboardPage.tsx": "Main wallet dashboard showing total assets and individual token balances (Infinity Coin, ICP, ckBTC, ckETH, ckSOL) with USD values using multiple balance hooks and exchange rates, plus Bitcoin deposit status.",
  "frontend/src/pages/HistoryPage.tsx": "Transaction history page that displays filtered transaction records with token icons, supports filtering by token type (Infinity, ICP, ckBTC, ckETH, ckSOL), and includes refresh functionality with loading states.",
  "frontend/src/pages/ReceivePage.tsx": "Receive tokens page displaying user's Principal address for ICRC-1 tokens and native Bitcoin deposit address via ckBTC minter, with copy-to-clipboard functionality for both addresses.",
  "frontend/src/pages/SendPage.tsx": "Send tokens page with multi-step form (form/confirm/success) supporting wrapped and native transfers for five token types, including validation, balance checks, and transaction recording.",
  "frontend/src/utils/urlParams.ts": "URL parameter utility functions for extracting query parameters from hash-based and browser routing, with sessionStorage persistence and cleanup capabilities.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, glow/neon shadow effects, extended font families (Inter, JetBrains Mono), and cosmic gradient backgrounds.",
  "project_state.json": "Project state tracking USD display precision issues (showing 0.00 for small amounts) and ckBTC deposit status decoding errors, with pending feature requests to implement extended decimal formatting."
}