{
  "backend/main.mo": "Main backend actor implementing a multi-coin wallet with transaction history, contacts, user profiles, and access control using MixinAuthorization. Supports ICP, ckBTC, ckETH, ckSOL, and infinityCoin with balances stored per principal.",
  "feature_evidence.json": "Feature evidence report documenting two Principal serialization bugs in useCkBtcDepositAddress and useCkBtcDepositStatus hooks where Principals are incorrectly sent as JSON objects instead of proper Candid types.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, hooks, pages, utilities, and styling for the Infinity Wallet application with Internet Identity authentication and multi-token support.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining colors for UI components, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point for the Infinity Wallet application with root div and module script loading main.tsx.",
  "frontend/SMOKE_TEST.md": "Smoke test checklist covering connection flow, profile setup, dashboard rendering, navigation, send/receive operations, contacts CRUD, and address validation for post-deployment validation.",
  "frontend/src/App.tsx": "Main app component managing Internet Identity authentication flow, profile setup dialog, page routing, loading states, and error handling with AppLayout wrapper and ThemeProvider.",
  "frontend/src/components/auth/AuthButton.tsx": "Authentication button component for Internet Identity sign-in/sign-out with loading states, error handling for duplicate authentication, and query cache clearing on logout.",
  "frontend/src/components/auth/PrincipalDisplay.tsx": "Component displaying the user's Principal with optional truncation and copy-to-clipboard functionality, styled with glassmorphic card and glow effects.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for new users to enter their name during initial profile setup. Prevents dismissal and submits via Enter key or button click.",
  "frontend/src/components/contacts/ContactEditorDialog.tsx": "Dialog for creating or editing contacts with name and address fields. Validates recipient addresses and handles both save and update operations.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "React error boundary component that catches unhandled errors and displays a styled error message with reload functionality.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with sticky header, navigation bar, and page routing for dashboard, send, receive, contacts, history, and contracts pages.",
  "frontend/src/components/layout/WalletLogo.tsx": "Displays the wallet logo image with gradient overlay and app name text using gradient styling.",
  "frontend/src/components/wallet/BalanceCard.tsx": "Card component displaying token balance with icon, loading states, error handling, and manual refresh button.",
  "frontend/src/components/wallet/BitcoinDepositStatus.tsx": "Shows progress indicator for pending Bitcoin deposits, displaying confirmation status and estimated processing time (6 confirmations).",
  "frontend/src/components/wallet/BitcoinFeeDisplay.tsx": "Alert component displaying Bitcoin network fee in satoshis and BTC, with processing time information for withdrawals.",
  "frontend/src/components/wallet/RecipientPicker.tsx": "Popover component with searchable contact list for selecting recipient addresses from saved contacts.",
  "frontend/src/components/wallet/TotalAssetsDisplay.tsx": "Displays total wallet assets with a denomination selector (InfinityCoin, ICP, ckBTC, ckETH, ckSOL); currently shows balance of selected token without cross-token conversion.",
  "frontend/src/components/wallet/TransferModeSelector.tsx": "Radio group component for selecting between wrapped token transfer (ICRC-1, fast) and native Bitcoin withdrawal (slower, with network fees).",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actor instances with authentication, initializing access control with admin token and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useCkBtcBalance.ts": "Fetches ckBTC balance from ICRC-1 ledger using authenticated identity with comprehensive debug logging for account construction and balance retrieval.",
  "frontend/src/hooks/useCkBtcDepositAddress.ts": "Retrieves the Bitcoin deposit address for the authenticated user from the ckBTC minter canister.",
  "frontend/src/hooks/useCkBtcDepositStatus.ts": "Polls ckBTC minter to check for pending Bitcoin deposits and update balance, refetching every 30 seconds.",
  "frontend/src/hooks/useCkBtcLedger.ts": "Initializes and manages authenticated ckBTC ICRC-1 ledger client with comprehensive debug logging, clearing client when identity is unavailable.",
  "frontend/src/hooks/useCkBtcMinter.ts": "Creates and manages ckBTC minter client instance based on authenticated identity state.",
  "frontend/src/hooks/useCkBtcMinterInfo.ts": "Fetches static minter configuration info from ckBTC minter canister with 5-minute cache.",
  "frontend/src/hooks/useCkBtcWithdraw.ts": "Mutation hook for initiating Bitcoin withdrawals via ckBTC minter, invalidating balance and transaction queries on success.",
  "frontend/src/hooks/useCkBtcWithdrawalStatus.ts": "Polls ckBTC minter for withdrawal status by block index every 10 seconds until confirmed.",
  "frontend/src/hooks/useCkEthBalance.ts": "React hook that fetches ckETH balance using TanStack Query, calling the ICRC-1 ledger's icrc1_balance_of method with the user's default account. Includes extensive console logging for debugging identity, account construction, and balance fetch operations.",
  "frontend/src/hooks/useCkEthLedger.ts": "React hook that initializes and manages an authenticated ckETH ICRC-1 ledger client using the user's Internet Identity. Handles client lifecycle, verifies actor methods, and provides initialization state with detailed console logging.",
  "frontend/src/hooks/useCkSolBalance.ts": "React hook that fetches ckSOL balance using TanStack Query, calling the ICRC-1 ledger's icrc1_balance_of method with the user's default account. Includes extensive console logging for debugging identity, account construction, and balance fetch operations.",
  "frontend/src/hooks/useCkSolLedger.ts": "React hook that initializes and manages an authenticated ckSOL ICRC-1 ledger client using the user's Internet Identity. Handles client lifecycle, verifies actor methods, and provides initialization state with detailed console logging.",
  "frontend/src/hooks/useIcpBalance.ts": "React hook that fetches ICP balance using TanStack Query, calling the ICRC-1 ledger's icrc1_balance_of method with the user's default account. Includes extensive console logging for debugging identity, account construction, and balance fetch operations.",
  "frontend/src/hooks/useIcpLedger.ts": "React hook that initializes and manages an authenticated ICP ICRC-1 ledger client using the user's Internet Identity. Handles client lifecycle, verifies actor methods, and provides initialization state with detailed console logging.",
  "frontend/src/hooks/useInfinityCoinBalance.ts": "React hook that fetches Infinity Coin balance using TanStack Query, calling the ICRC-1 ledger's icrc1_balance_of method with the user's default account. Includes extensive console logging for debugging identity, account construction, and balance fetch operations.",
  "frontend/src/hooks/useInfinityLedger.ts": "React hook that initializes and manages an authenticated Infinity Coin ICRC-1 ledger client using the user's Internet Identity. Handles client lifecycle, verifies actor methods, and provides initialization state with detailed console logging.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, providing login/logout functionality, identity state management, and status tracking with configurable AuthClient options.",
  "frontend/src/hooks/useOisyActor.ts": "Empty file, likely a placeholder for Oisy actor-related hooks.",
  "frontend/src/hooks/useOisyWallet.tsx": "Empty file, likely a placeholder for Oisy wallet-related hooks.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user profiles, transaction history, and contacts management, using TanStack Query for data fetching and mutations with toast notifications.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom cosmic/neon theme using OKLCH color space, defining light/dark mode variables and neon glow utilities for cyan, purple, and magenta accents.",
  "frontend/src/lib/branding.ts": "Exports branding constants including app name 'Infinity Wallet' and supported token symbols (ICP, ckBTC, ckETH, ckSOL, Infinity Coin).",
  "frontend/src/lib/ckBtcLedger/client.ts": "ICRC-1 ckBTC ledger client implementation with TypeScript types, IDL factory, and authenticated actor creation for balance queries and transfers with comprehensive debugging.",
  "frontend/src/lib/ckBtcLedger/config.ts": "Exports the ckBTC ICRC-1 ledger canister ID constant (mxzaz-hqaaa-aaaar-qaada-cai).",
  "frontend/src/lib/ckBtcLedger/index.ts": "Re-exports ckBTC ledger configuration, client functions, and TypeScript types for external consumption.",
  "frontend/src/lib/ckBtcMinter/client.ts": "ckBTC minter client implementation with TypeScript types and IDL factory for Bitcoin address generation, balance updates, BTC retrieval, and status queries.",
  "frontend/src/lib/ckBtcMinter/config.ts": "Exports the ckBTC minter canister ID constant (mqygn-kiaaa-aaaar-qaadq-cai) for mainnet.",
  "frontend/src/lib/ckBtcMinter/index.ts": "Re-exports all ckBTC minter configuration and client exports.",
  "frontend/src/lib/ckEthLedger/client.ts": "Creates an authenticated ICRC-1 ckETH ledger client with comprehensive debugging, defining types for accounts, transfers, and errors, plus an IDL factory for canister communication.",
  "frontend/src/lib/ckEthLedger/config.ts": "Exports the ckETH ledger canister ID constant 'ss2fx-dyaaa-aaaar-qacoq-cai'.",
  "frontend/src/lib/ckEthLedger/index.ts": "Re-exports ckETH ledger configuration, client creation function, and ICRC-1 types for external use.",
  "frontend/src/lib/ckSolLedger/client.ts": "Creates an authenticated ICRC-1 ckSOL ledger client with comprehensive debugging, defining types for accounts, transfers, and errors, plus an IDL factory for canister communication.",
  "frontend/src/lib/ckSolLedger/config.ts": "Exports the ckSOL ledger canister ID constant 'zfcdd-tqaaa-aaaaq-aaaga-cai'.",
  "frontend/src/lib/ckSolLedger/index.ts": "Re-exports ckSOL ledger configuration, client creation function, and ICRC-1 types for external use.",
  "frontend/src/lib/icpAccountId.ts": "Derives ICP Ledger Account Identifiers from Principals using SHA-224 hashing and CRC32 checksums with default subaccount.",
  "frontend/src/lib/icpLedger/client.ts": "Creates an authenticated ICRC-1 ICP ledger client with comprehensive debugging, defining types for accounts, transfers, and errors, plus an IDL factory for canister communication.",
  "frontend/src/lib/icpLedger/config.ts": "Exports the ICP ledger canister ID constant 'ryjl3-tyaaa-aaaaa-aaaba-cai'.",
  "frontend/src/lib/icpLedger/index.ts": "Re-exports ICP ledger configuration, client creation function, and ICRC-1 types for external use.",
  "frontend/src/lib/infinityLedger/client.ts": "Creates an authenticated ICRC-1 Infinity Coin ledger client with comprehensive debugging, defining types for accounts, transfers, and errors, plus an IDL factory for canister communication.",
  "frontend/src/lib/infinityLedger/config.ts": "Exports the Infinity Coin ledger canister ID constant 'atuk3-uqaaa-aaaam-qduwa-cai'.",
  "frontend/src/lib/infinityLedger/index.ts": "Re-exports Infinity Coin ledger configuration, client creation function, and ICRC-1 types for external use.",
  "frontend/src/lib/utils.ts": "Provides utility functions for CSS class merging (cn), truncating principal strings, and formatting bigint timestamps to human-readable dates.",
  "frontend/src/lib/validation.ts": "Provides validation functions for cryptocurrency addresses (ICP Principal/Account ID, Bitcoin, Ethereum, Solana) and amounts, plus utilities for parsing amounts to e8s format and formatting balances.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/ContactsPage.tsx": "Displays and manages a user's address book with add, edit, and delete functionality for contacts, using custom hooks for data fetching and mutations.",
  "frontend/src/pages/ContractsPage.tsx": "Provides a UI for calling canister methods with Internet Identity authentication, currently implementing a demo/mock contract call interface.",
  "frontend/src/pages/DashboardPage.tsx": "Main wallet dashboard displaying total assets and individual token balances (InfinityCoin, ICP, ckBTC, ckETH, ckSOL) with Bitcoin deposit status and navigation controls.",
  "frontend/src/pages/HistoryPage.tsx": "Displays transaction history with token filtering, showing locally recorded transaction submissions with a note that actual balances are controlled by ICRC-1 ledgers.",
  "frontend/src/pages/ReceivePage.tsx": "React component displaying receive addresses for multiple tokens (Infinity, ICP, ckBTC, ckETH, ckSOL) with unified ICRC-1 principal addressing, copy-to-clipboard functionality, and ckBTC deposit address generation with retry capability.",
  "frontend/src/pages/SendPage.tsx": "React component for sending tokens with multi-step flow (form, confirm, success), supporting both wrapped (ICRC-1) and native transfers for multiple tokens, including balance checks, validation, and transaction recording.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extending colors (using OKLCH color space), typography, container queries, animations, custom shadows including glow effects, and font families for the wallet UI.",
  "project_state.json": "Project metadata tracking Infinity Wallet's multi-token support and documenting critical bug where ckBTC minter receives Principal as JSON object instead of proper Candid type, with two fix requests in progress."
}