{
  "backend/main.mo": "Main Motoko actor implementing a multi-token wallet backend with access control, transaction recording, contact management, user profiles, and balance tracking for five coin types (ICP, ckBTC, ckETH, ckSOL, infinityCoin).",
  "feature_evidence.json": "Feature evidence report documenting three completed features: USD portfolio value calculation in TotalAssetsDisplay, individual token USD values on dashboard, and removal of exchange rate implementation note.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, utilities, and styling with details on authentication flow, token management, USD conversion, validation, and neon-themed UI design.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining colors for UI elements like background, foreground, cards, borders, and charts.",
  "frontend/index.html": "HTML entry point with viewport meta tag, title 'Infinity Wallet', root div, and module script loading main.tsx.",
  "frontend/SMOKE_TEST.md": "Smoke test checklist covering seven test scenarios: connection flow, profile setup, dashboard render, navigation, send form with address validation, receive copy-to-clipboard, and contacts CRUD operations.",
  "frontend/src/App.tsx": "Main React app component managing Internet Identity authentication states (isInitializing, isLoggingIn, isLoginError), profile setup dialog, page routing between six pages, and error handling with loading and error UI states.",
  "frontend/src/components/auth/AuthButton.tsx": "Authentication button component handling Internet Identity login/logout with loading states, query cache clearing on logout, and error recovery for duplicate authentication attempts.",
  "frontend/src/components/auth/PrincipalDisplay.tsx": "Displays the user's Internet Identity principal with optional truncation and a copy-to-clipboard button. Shows a styled card with the principal text and copy icon that changes to a checkmark on successful copy.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for first-time user profile setup that prompts for a name input. Cannot be dismissed and saves the profile using the useSaveCallerUserProfile mutation.",
  "frontend/src/components/contacts/ContactEditorDialog.tsx": "Dialog for adding or editing contacts with name and address fields. Validates recipient addresses and uses useSaveContact or useUpdateContact mutations depending on whether editing an existing contact.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "React error boundary component that catches and displays application errors with a reload button. Shows error details in a collapsible section and provides a full-page error UI.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with header, navigation bar, and content area. Displays logo, auth button, principal, and navigation buttons for dashboard, receive, send, contacts, history, and contracts pages.",
  "frontend/src/components/layout/WalletLogo.tsx": "Renders the wallet logo image with gradient overlay and app name text. Uses branding constants and applies futuristic styling with gradient text effects.",
  "frontend/src/components/wallet/BalanceCard.tsx": "Card component displaying token balance with icon, name, and optional USD value. Includes refresh button, loading skeletons, and error states.",
  "frontend/src/components/wallet/BitcoinDepositStatus.tsx": "Alert component that displays pending Bitcoin deposit status using useCkBtcDepositStatus hook. Shows only when there are pending deposits and includes a refresh button.",
  "frontend/src/components/wallet/BitcoinFeeDisplay.tsx": "Alert component displaying Bitcoin network fee information in satoshis and BTC. Shows processing time estimate and explains the ckBTC burn and Bitcoin send process.",
  "frontend/src/components/wallet/RecipientPicker.tsx": "Popover button with searchable contact list for selecting transaction recipients. Uses Command component for filtering and displays contact names with truncated addresses.",
  "frontend/src/components/wallet/TotalAssetsDisplay.tsx": "Displays total wallet assets across multiple tokens (Infinity Coin, ICP, ckBTC, ckETH, ckSOL) with USD value calculation and denomination currency selector.",
  "frontend/src/components/wallet/TransferModeSelector.tsx": "Radio group component for selecting between wrapped ICRC-1 token transfers (fast, cheap) and native Bitcoin withdrawals (slower, network fees).",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor with identity-based authentication, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useCkBtcBalance.ts": "Fetches ckBTC balance from ICRC-1 ledger using authenticated identity with comprehensive debug logging for account construction and balance retrieval.",
  "frontend/src/hooks/useCkBtcDepositAddress.ts": "Queries the ckBTC minter to get a Bitcoin deposit address for the authenticated user's principal, with mainnet-only error handling.",
  "frontend/src/hooks/useCkBtcDepositStatus.ts": "Polls ckBTC minter for pending Bitcoin deposit UTXOs and their confirmation status, parsing results into pending/confirmed/minted states.",
  "frontend/src/hooks/useCkBtcLedger.ts": "Creates and manages authenticated ckBTC ICRC-1 ledger client instance, initializing when identity is available with method verification logging.",
  "frontend/src/hooks/useCkBtcMinter.ts": "Creates and manages ckBTC minter client instance tied to authenticated identity for Bitcoin deposit/withdrawal operations.",
  "frontend/src/hooks/useCkBtcMinterInfo.ts": "Queries ckBTC minter for configuration info (fees, limits, etc.) with 5-minute cache staleness.",
  "frontend/src/hooks/useCkBtcWithdraw.ts": "Mutation hook for withdrawing ckBTC to native Bitcoin addresses via minter, invalidating balance and transaction queries on success.",
  "frontend/src/hooks/useCkBtcWithdrawalStatus.ts": "React Query hook that polls the ckBTC minter for withdrawal status by block index, refetching every 10 seconds until confirmed.",
  "frontend/src/hooks/useCkEthBalance.ts": "React Query hook that fetches ckETH balance from the ICRC-1 ledger with extensive console logging for debugging identity, account construction, and balance retrieval.",
  "frontend/src/hooks/useCkEthLedger.ts": "React hook that initializes and manages an authenticated ckETH ledger client, creating it when identity is available and logging initialization steps.",
  "frontend/src/hooks/useCkSolBalance.ts": "React Query hook that fetches ckSOL balance from the ICRC-1 ledger with comprehensive debugging logs for identity, account, and balance operations.",
  "frontend/src/hooks/useCkSolLedger.ts": "React hook that initializes and manages an authenticated ckSOL ledger client, verifying actor methods and logging the initialization process.",
  "frontend/src/hooks/useExchangeRates.ts": "React Query hook that fetches exchange rates for ICP, ckBTC, ckETH, ckSOL, and Infinity Coin from ICPSwap API, parsing USD pairs and caching for 60 seconds.",
  "frontend/src/hooks/useIcpBalance.ts": "React Query hook that fetches ICP balance from the ICRC-1 ledger with detailed console logging for debugging account construction and balance retrieval.",
  "frontend/src/hooks/useIcpLedger.ts": "React hook that initializes and manages an authenticated ICP ledger client, creating it when identity is available and verifying actor methods.",
  "frontend/src/hooks/useInfinityCoinBalance.ts": "React Query hook that fetches the Infinity Coin balance from the ICRC-1 ledger using the authenticated identity and ledger client, with extensive console logging for debugging balance fetch operations.",
  "frontend/src/hooks/useInfinityLedger.ts": "React hook that creates and manages an authenticated Infinity Coin ledger client, initializing it when an identity is available and providing comprehensive debug logging of the client creation process.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and providing login/logout functionality using the @dfinity/auth-client.",
  "frontend/src/hooks/useOisyActor.ts": "Empty file with no content.",
  "frontend/src/hooks/useOisyWallet.tsx": "Empty file with no content.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user profiles, transaction history, and contacts, providing CRUD operations that interact with the backend actor and manage cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light/dark cosmic theme, including neon cyan/purple/magenta accents and glow utilities for a space-themed UI.",
  "frontend/src/lib/branding.ts": "Exports constant strings for application name and supported token symbols (ICP, ckBTC, ckETH, ckSOL, Infinity Coin).",
  "frontend/src/lib/ckBtcLedger/client.ts": "Creates authenticated ICRC-1 ledger client for ckBTC with TypeScript types and IDL factory, providing methods for balance queries, transfers, and token metadata with debug logging.",
  "frontend/src/lib/ckBtcLedger/config.ts": "Exports the ckBTC ICRC-1 ledger canister ID constant as the single source of truth.",
  "frontend/src/lib/ckBtcLedger/index.ts": "Re-exports ckBTC ledger configuration, client creation functions, and TypeScript types from the ckBtcLedger module.",
  "frontend/src/lib/ckBtcMinter/client.ts": "Defines TypeScript types and IDL factory for the ckBTC minter canister, providing interfaces for Bitcoin address generation, balance updates, BTC retrieval, and minter info queries.",
  "frontend/src/lib/ckBtcMinter/config.ts": "Exports the official ckBTC minter canister ID for mainnet.",
  "frontend/src/lib/ckBtcMinter/index.ts": "Re-exports all configuration and client functionality from the ckBtcMinter module.",
  "frontend/src/lib/ckEthLedger/client.ts": "Implements ICRC-1 ledger client for ckETH with comprehensive debugging, providing balance queries, transfers, and metadata functions using the Dfinity agent.",
  "frontend/src/lib/ckEthLedger/config.ts": "Exports the ckETH ICRC-1 ledger canister ID as the single source of truth.",
  "frontend/src/lib/ckEthLedger/index.ts": "Re-exports ckETH ledger configuration, client factory, and all ICRC-1 types for external use.",
  "frontend/src/lib/ckSolLedger/client.ts": "Implements ICRC-1 ledger client for ckSOL with debugging support, mirroring ckETH client structure for balance, transfer, and metadata operations.",
  "frontend/src/lib/ckSolLedger/config.ts": "Exports the ckSOL ICRC-1 ledger canister ID as the single source of truth.",
  "frontend/src/lib/ckSolLedger/index.ts": "Re-exports ckSOL ledger configuration, client factory, and all ICRC-1 types for external use.",
  "frontend/src/lib/icpAccountId.ts": "Provides functions to derive ICP Ledger Account Identifiers from Principals using SHA-224 hashing and CRC32 checksums according to the standard derivation formula.",
  "frontend/src/lib/icpLedger/client.ts": "Implements ICRC-1 ledger client for ICP with debugging support, providing balance queries, transfers, fee queries, and metadata functions.",
  "frontend/src/lib/icpLedger/config.ts": "Exports the ICP ICRC-1 ledger canister ID as the single source of truth.",
  "frontend/src/lib/icpLedger/index.ts": "Re-exports ICP ledger configuration, client factory, and all ICRC-1 types for external use.",
  "frontend/src/lib/infinityLedger/client.ts": "Defines ICRC-1 ledger client for Infinity Coin with types for accounts, transfers, and errors. Exports createInfinityLedgerClient function that creates an authenticated actor using @dfinity/agent with comprehensive debugging and IDL factory.",
  "frontend/src/lib/infinityLedger/config.ts": "Exports the Infinity Coin ICRC-1 ledger canister ID constant (atuk3-uqaaa-aaaam-qduwa-cai) as the single source of truth.",
  "frontend/src/lib/infinityLedger/index.ts": "Re-exports all Infinity Coin ledger integration types and functions from config and client modules for convenient importing.",
  "frontend/src/lib/utils.ts": "Provides utility functions: cn for merging Tailwind classes, truncatePrincipal for shortening principal strings, and formatTimestamp for converting bigint timestamps to readable dates.",
  "frontend/src/lib/validation.ts": "Contains validation functions for cryptocurrency addresses (ICP, Bitcoin, Ethereum, Solana) and amounts, plus utilities for parsing amounts to e8s format and formatting balances.",
  "frontend/src/main.tsx": "Application entry point that renders the root component with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/ContactsPage.tsx": "Displays and manages saved contacts with add, edit, and delete functionality using custom hooks and shadcn/ui components with confirmation dialogs.",
  "frontend/src/pages/ContractsPage.tsx": "Provides UI for calling canister methods with Internet Identity authentication, including form inputs for canister ID, method name, and JSON arguments with simulated execution.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard displaying total assets and individual token balances (Infinity Coin, ICP, ckBTC, ckETH, ckSOL) with USD values, Bitcoin deposit status, and navigation props.",
  "frontend/src/pages/HistoryPage.tsx": "Transaction history page that displays filtered transaction records with token icons, supports filtering by token type, and shows alerts about local vs on-chain transaction tracking.",
  "frontend/src/pages/ReceivePage.tsx": "Receive tokens page displaying the user's Principal address for ICRC-1 tokens and a native Bitcoin deposit address for ckBTC conversion with copy-to-clipboard functionality.",
  "frontend/src/pages/SendPage.tsx": "Send tokens page with multi-step form supporting wrapped (ICRC-1) and native transfers for multiple token types (Infinity Coin, ICP, ckBTC, ckETH, ckSOL) with validation, confirmation, and transaction recording.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, extended shadows with glow effects, custom fonts (Inter, JetBrains Mono), and container settings.",
  "project_state.json": "Project state tracking file for Infinity Wallet showing pending feature requests to implement USD value display using ICP oracle/ICPSwap exchange rates for portfolio and individual token balances."
}