{
  "backend/main.mo": "Main backend actor implementing wallet functionality with transaction recording, contact management, user profiles, and access control using MixinAuthorization. Manages ICP and Infinity Coin balances with transaction history and contact CRUD operations.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence fixes for ICRC-1 Account record structure issues, ensuring proper subaccount field handling (as optional array [] or [Uint8Array]) across frontend hooks, ledger client, and page components.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including authentication flows, wallet pages (Dashboard, Send, Receive, Contacts, History), ICRC-1 ledger integration, styling with neon theme, and validation utilities for ICP Account IDs and Principals.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining colors for UI components, charts, sidebar, and semantic tokens.",
  "frontend/index.html": "HTML entry point for the Infinity Wallet React application with root div and module script reference to main.tsx.",
  "frontend/SMOKE_TEST.md": "Repeatable smoke test checklist covering connection flow, profile setup, dashboard rendering, navigation, send/receive operations, contacts CRUD, and address format validation for post-deployment validation.",
  "frontend/src/App.tsx": "Root application component managing Internet Identity authentication states (isInitializing, isLoggingIn, isLoginError), profile setup dialog, page routing between wallet pages, and error handling with loading states.",
  "frontend/src/components/auth/AuthButton.tsx": "Authentication button component for Internet Identity sign-in/sign-out with loading states, query cache clearing on logout, and error handling for duplicate authentication attempts.",
  "frontend/src/components/auth/PrincipalDisplay.tsx": "Displays the user's Internet Identity principal with optional truncation and copy-to-clipboard functionality in a styled card component.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for first-time users to enter their name and complete profile setup, preventing dismissal until completed.",
  "frontend/src/components/contacts/ContactEditorDialog.tsx": "Dialog component for adding or editing contacts with name and address validation, supporting both ICP Account IDs and Principals.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "React error boundary component that catches application errors and displays a styled error UI with reload functionality and error details.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with header, navigation bar, and page routing for dashboard, send, receive, contacts, history, and contracts pages.",
  "frontend/src/components/layout/WalletLogo.tsx": "Renders the Infinity Wallet logo image with gradient text branding and visual effects.",
  "frontend/src/components/wallet/RecipientPicker.tsx": "Popover component with searchable command palette for selecting recipient addresses from saved contacts.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on authentication state, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInfinityCoinBalance.ts": "React Query hook that fetches the user's Infinity Coin balance from the ICRC-1 ledger with comprehensive debug logging for account construction and balance calls.",
  "frontend/src/hooks/useInfinityLedger.ts": "React hook that creates and manages an authenticated ICRC-1 Infinity Coin ledger client, initializing it when an identity is available and providing comprehensive debug logging throughout the initialization process.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and providing login/logout functionality with configurable AuthClient options.",
  "frontend/src/hooks/useOisyActor.ts": "Empty file with no content.",
  "frontend/src/hooks/useOisyWallet.tsx": "Empty file with no content.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for managing user profiles, transaction history, and contacts with mutations that invalidate queries on success and display toast notifications.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom cosmic/neon theme using OKLCH color space, defining light and dark mode color schemes with cyan, purple, and magenta accents plus neon glow utilities.",
  "frontend/src/lib/branding.ts": "Exports application branding constants including app name and token names for ICP and Infinity Coin.",
  "frontend/src/lib/icpAccountId.ts": "Implements ICP Ledger Account Identifier derivation from Principal using SHA-224 hashing and CRC32 checksum, including full cryptographic implementations of both algorithms.",
  "frontend/src/lib/infinityLedger/client.ts": "Creates authenticated ICRC-1 ledger actor for Infinity Coin with TypeScript interfaces for accounts, transfers, and errors, plus IDL factory and comprehensive debug logging.",
  "frontend/src/lib/infinityLedger/config.ts": "Single source of truth configuration file exporting the Infinity Coin ICRC-1 ledger canister ID constant.",
  "frontend/src/lib/infinityLedger/index.ts": "Main export module for Infinity Coin ledger integration, re-exporting configuration, client functions, and TypeScript types.",
  "frontend/src/lib/utils.ts": "Utility functions for CSS class merging (cn), principal truncation, and timestamp formatting for display.",
  "frontend/src/lib/validation.ts": "Provides validation functions for recipient addresses (ICP Account ID or Principal) and amounts, plus utilities to format balances and parse amounts to e8s (smallest ICP unit).",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the main App component.",
  "frontend/src/pages/ContactsPage.tsx": "Displays and manages a user's address book with add, edit, and delete functionality for contacts, using React Query hooks and confirmation dialogs.",
  "frontend/src/pages/ContractsPage.tsx": "Provides a UI for calling canister methods with JSON arguments; currently simulates calls as a demo implementation requiring Internet Identity authentication.",
  "frontend/src/pages/DashboardPage.tsx": "Shows the user's Infinity Coin balance with refresh capability and detailed error reporting including copy-to-clipboard functionality for debugging balance fetch failures.",
  "frontend/src/pages/HistoryPage.tsx": "Displays a list of locally recorded transaction submissions with refresh capability, showing sent transactions with recipient, amount, and timestamp details.",
  "frontend/src/pages/ReceivePage.tsx": "Shows the user's Principal address and subaccount information for receiving Infinity Coin, with copy-to-clipboard functionality and instructions.",
  "frontend/src/pages/SendPage.tsx": "React component for sending Infinity Coin tokens with form validation, recipient selection, amount input, confirmation step, and ICRC-1 ledger transfer execution with error handling and transaction recording.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, typography, container queries, animations, custom shadows including glow effects, and extended font families for the application theme.",
  "project_state.json": "Project metadata tracking known issue with ICRC-1 balance fetch failing due to missing subaccount field, and three existing features addressing the Account record structure to match ICRC-1 specification with owner (Principal) and subaccount (opt blob) fields."
}