{
  "backend/main.mo": "Canister backend managing user profiles, transactions, and contacts with access control and storage for balances and history.",
  "feature_evidence.json": "Feature evidence report mapping product features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for multiple frontend files.",
  "frontend/index.css": "Tailwind CSS base and theme variable definitions for light and dark modes.",
  "frontend/index.html": "Base HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app component handling authentication, routing, theming, and page rendering.",
  "frontend/src/components/auth/AuthButton.tsx": "Authentication button component supporting Internet Identity login/logout with loading states.",
  "frontend/src/components/auth/PrincipalDisplay.tsx": "Displays the user's principal with copy‑to‑clipboard functionality and truncation.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for first‑time users to enter and save their profile name.",
  "frontend/src/components/contacts/ContactEditorDialog.tsx": "Modal form for adding or editing a contact with validation and save/update mutations.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with header, auth controls, and navigation tabs based on the current page.",
  "frontend/src/components/layout/WalletLogo.tsx": "Renders the app logo and name with styled visual effects.",
  "frontend/src/components/wallet/RecipientPicker.tsx": "Popover UI for selecting a contact as a transaction recipient from a searchable list.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to the authenticated identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for managing Internet Identity login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles, balances, transactions, and contacts through the backend actor.",
  "frontend/src/index.css": "Tailwind setup with custom light and dark theme variables, glow effects, and global background styling.",
  "frontend/src/lib/branding.ts": "Exports app and token name constants.",
  "frontend/src/lib/icpAccountId.ts": "Implements ICP account ID derivation from a Principal using SHA‑224 and CRC32.",
  "frontend/src/lib/utils.ts": "Utility helpers for class merging, principal truncation, and timestamp formatting.",
  "frontend/src/lib/validation.ts": "Validation helpers for recipients and amounts plus balance formatting and amount parsing.",
  "frontend/src/main.tsx": "Application entry point initializing React, query client, Internet Identity, and global styles.",
  "frontend/src/pages/ContactsPage.tsx": "Displays and manages the contact list with CRUD UI, dialogs, and loading states.",
  "frontend/src/pages/DashboardPage.tsx": "Shows ICP and Infinity Coin balances with refresh behavior and loading handling.",
  "frontend/src/pages/HistoryPage.tsx": "Displays locally stored transaction history with filtering, refresh, and loading states.",
  "frontend/src/pages/ReceivePage.tsx": "Displays the user’s ICP Account ID derived from their principal and provides copy-to-clipboard functionality with alerts and guidance for receiving ICP.",
  "frontend/src/pages/SendPage.tsx": "Implements a multi‑step flow for sending ICP or Infinity Coin, including validation, confirmation, and recording transactions with success feedback.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from hash-based routing.",
  "frontend/tailwind.config.js": "Defines Tailwind theme extensions, colors, fonts, shadows, and plugins to support the app’s custom UI styling.",
  "project_state.json": "Stores project metadata, requirements, existing features, and architectural notes describing the Infinity Wallet build state."
}