{
  "backend/main.mo": "Main Motoko actor implementing a multi-coin wallet backend with authorization, user profiles, transaction history, contacts management, and balance tracking for ICP, ckBTC, ckETH, ckSOL, and Infinity Coin.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence bugs: incorrect ckBTC minter method name in useCkBtcDepositAddress hook and decoding error in useCkBtcDepositStatus hook.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including React components, hooks, pages, utilities, and styling for the Infinity Wallet application with Internet Identity authentication and multi-token support.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining colors for UI components, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point for the Infinity Wallet application with root div and module script reference to main.tsx.",
  "frontend/SMOKE_TEST.md": "Smoke test checklist covering connection flow, profile setup, dashboard rendering, navigation, send/receive operations, contacts CRUD, and address validation for post-deployment validation.",
  "frontend/src/App.tsx": "Main React application component managing Internet Identity authentication flow, profile setup dialog, page routing, loading states, and error handling with theme provider and toast notifications.",
  "frontend/src/components/auth/AuthButton.tsx": "Authentication button component for Internet Identity sign-in/sign-out with loading states, error handling for duplicate authentication, and query cache clearing on logout.",
  "frontend/src/components/auth/PrincipalDisplay.tsx": "Displays the user's Internet Identity principal with optional truncation and copy-to-clipboard functionality. Shows a styled card with the principal text and a copy button that provides visual feedback.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for first-time user profile setup that prompts for a name. Cannot be dismissed and saves the profile using the useSaveCallerUserProfile hook.",
  "frontend/src/components/contacts/ContactEditorDialog.tsx": "Dialog component for creating or editing contacts with name and address fields. Validates recipient addresses and uses useSaveContact/useUpdateContact hooks for persistence.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "React error boundary component that catches and displays application errors with a reload button. Shows error details in an expandable section for debugging.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with header, navigation bar, and content area. Provides navigation between dashboard, send, receive, contacts, history, and contracts pages with futuristic styling.",
  "frontend/src/components/layout/WalletLogo.tsx": "Renders the application logo with gradient text and glow effects. Displays the app name from branding configuration alongside the logo image.",
  "frontend/src/components/wallet/BalanceCard.tsx": "Card component displaying token balance with icon, loading states, error handling, and refresh functionality. Formats balance and shows skeleton loader during data fetching.",
  "frontend/src/components/wallet/BitcoinDepositStatus.tsx": "Alert component that displays pending Bitcoin deposit status using useCkBtcDepositStatus hook. Shows processing information and refresh button when deposits are pending.",
  "frontend/src/components/wallet/BitcoinFeeDisplay.tsx": "Informational alert displaying Bitcoin network fees in satoshis and BTC, along with processing time estimates. Shows loading state while fee calculation is in progress.",
  "frontend/src/components/wallet/RecipientPicker.tsx": "Popover component with searchable contact list for selecting transaction recipients. Displays contact names and truncated addresses, calling onSelect callback when a contact is chosen.",
  "frontend/src/components/wallet/TotalAssetsDisplay.tsx": "Displays total wallet assets with denomination selector for multiple tokens (InfinityCoin, ICP, ckBTC, ckETH, ckSOL), showing the selected token's balance without cross-token conversion.",
  "frontend/src/components/wallet/TransferModeSelector.tsx": "Radio group component for selecting between wrapped token transfers (fast ICRC-1) and native Bitcoin withdrawals (slower with network fees).",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor with authentication, initializing access control and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useCkBtcBalance.ts": "Fetches ckBTC balance from ICRC-1 ledger using the user's principal and default account, with comprehensive debug logging.",
  "frontend/src/hooks/useCkBtcDepositAddress.ts": "Retrieves the user's Bitcoin deposit address from the ckBTC minter canister, with mainnet-only error handling for local development.",
  "frontend/src/hooks/useCkBtcDepositStatus.ts": "Checks for pending Bitcoin deposits by calling the minter's update_balance method, with graceful handling for local development environments.",
  "frontend/src/hooks/useCkBtcLedger.ts": "Creates and manages an authenticated ckBTC ICRC-1 ledger client, initializing it when identity is available with detailed debug logging.",
  "frontend/src/hooks/useCkBtcMinter.ts": "Creates and manages the ckBTC minter client instance, initializing it when user identity is available.",
  "frontend/src/hooks/useCkBtcMinterInfo.ts": "Fetches static minter configuration information with 5-minute cache, enabled only when minter client is ready.",
  "frontend/src/hooks/useCkBtcWithdraw.ts": "Mutation hook for withdrawing ckBTC to native Bitcoin addresses, invalidating balance and transaction queries on success.",
  "frontend/src/hooks/useCkBtcWithdrawalStatus.ts": "Polls withdrawal status by block index every 10 seconds until confirmed, stopping when transaction is finalized.",
  "frontend/src/hooks/useCkEthBalance.ts": "React hook that fetches ckETH balance using TanStack Query, calling the ICRC-1 ledger's icrc1_balance_of method with comprehensive console logging for debugging.",
  "frontend/src/hooks/useCkEthLedger.ts": "React hook that initializes and manages an authenticated ckETH ledger client, creating it when identity is available and verifying actor methods with detailed logging.",
  "frontend/src/hooks/useCkSolBalance.ts": "React hook that fetches ckSOL balance using TanStack Query, calling the ICRC-1 ledger's icrc1_balance_of method with comprehensive console logging for debugging.",
  "frontend/src/hooks/useCkSolLedger.ts": "React hook that initializes and manages an authenticated ckSOL ledger client, creating it when identity is available and verifying actor methods with detailed logging.",
  "frontend/src/hooks/useIcpBalance.ts": "React hook that fetches ICP balance using TanStack Query, calling the ICRC-1 ledger's icrc1_balance_of method with comprehensive console logging for debugging.",
  "frontend/src/hooks/useIcpLedger.ts": "React hook that initializes and manages an authenticated ICP ledger client, creating it when identity is available and verifying actor methods with detailed logging.",
  "frontend/src/hooks/useInfinityCoinBalance.ts": "React hook that fetches Infinity Coin balance using TanStack Query, calling the ICRC-1 ledger's icrc1_balance_of method with comprehensive console logging for debugging.",
  "frontend/src/hooks/useInfinityLedger.ts": "React hook that initializes and manages an authenticated Infinity Coin ledger client, creating it when identity is available and verifying actor methods with detailed logging.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useOisyActor.ts": "Empty file, no content.",
  "frontend/src/hooks/useOisyWallet.tsx": "Empty file, no content.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user profiles, transaction history, and contacts management with mutations that invalidate caches and show toast notifications.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light/dark cosmic theme, neon glow utilities (cyan, purple, magenta), and animated starfield background.",
  "frontend/src/lib/branding.ts": "Exports branding constants including app name 'Infinity Wallet' and supported token symbols (ICP, ckBTC, ckETH, ckSOL, Infinity Coin).",
  "frontend/src/lib/ckBtcLedger/client.ts": "ICRC-1 ckBTC ledger client implementation with TypeScript types, IDL factory, and authenticated actor creation with comprehensive debugging for balance queries and transfers.",
  "frontend/src/lib/ckBtcLedger/config.ts": "Exports the ckBTC ICRC-1 ledger canister ID constant 'mxzaz-hqaaa-aaaar-qaada-cai'.",
  "frontend/src/lib/ckBtcLedger/index.ts": "Re-exports ckBTC ledger configuration, client functions, and TypeScript types for ICRC-1 account and transfer operations.",
  "frontend/src/lib/ckBtcMinter/client.ts": "ckBTC minter client with TypeScript types and IDL factory for Bitcoin address generation, balance updates, BTC retrieval, and status queries.",
  "frontend/src/lib/ckBtcMinter/config.ts": "Exports the ckBTC minter canister ID constant 'mqygn-kiaaa-aaaar-qaadq-cai' for mainnet.",
  "frontend/src/lib/ckBtcMinter/index.ts": "Re-exports all ckBTC minter configuration and client functionality.",
  "frontend/src/lib/ckEthLedger/client.ts": "Creates an authenticated ICRC-1 ckETH ledger client with comprehensive debugging, including types for accounts, transfers, and errors, plus an IDL factory for canister communication.",
  "frontend/src/lib/ckEthLedger/config.ts": "Exports the ckETH ledger canister ID constant as the single source of truth.",
  "frontend/src/lib/ckEthLedger/index.ts": "Re-exports ckETH ledger configuration, client creation function, and all ICRC-1 types for external use.",
  "frontend/src/lib/ckSolLedger/client.ts": "Creates an authenticated ICRC-1 ckSOL ledger client with comprehensive debugging, including types for accounts, transfers, and errors, plus an IDL factory for canister communication.",
  "frontend/src/lib/ckSolLedger/config.ts": "Exports the ckSOL ledger canister ID constant as the single source of truth.",
  "frontend/src/lib/ckSolLedger/index.ts": "Re-exports ckSOL ledger configuration, client creation function, and all ICRC-1 types for external use.",
  "frontend/src/lib/icpAccountId.ts": "Derives ICP Ledger Account Identifiers from Principals using SHA-224 hashing and CRC32 checksums with default subaccounts.",
  "frontend/src/lib/icpLedger/client.ts": "Creates an authenticated ICRC-1 ICP ledger client with comprehensive debugging, including types for accounts, transfers, and errors, plus an IDL factory for canister communication.",
  "frontend/src/lib/icpLedger/config.ts": "Exports the ICP ledger canister ID constant as the single source of truth.",
  "frontend/src/lib/icpLedger/index.ts": "Re-exports ICP ledger configuration, client creation function, and all ICRC-1 types for external use.",
  "frontend/src/lib/infinityLedger/client.ts": "Creates an authenticated ICRC-1 Infinity Coin ledger client with comprehensive debugging, including types for accounts, transfers, and errors, plus an IDL factory for canister communication.",
  "frontend/src/lib/infinityLedger/config.ts": "Exports the Infinity Coin ledger canister ID constant as the single source of truth.",
  "frontend/src/lib/infinityLedger/index.ts": "Re-exports Infinity Coin ledger configuration, client creation function, and all ICRC-1 types for external use.",
  "frontend/src/lib/utils.ts": "Provides utility functions for CSS class merging, principal truncation, and timestamp formatting.",
  "frontend/src/lib/validation.ts": "Provides validation functions for cryptocurrency addresses (ICP Principal/Account ID, Bitcoin, Ethereum, Solana) and amounts, plus utilities for parsing amounts to e8s format and formatting balances.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/ContactsPage.tsx": "Displays and manages a user's saved contacts with add, edit, and delete functionality using custom hooks and confirmation dialogs.",
  "frontend/src/pages/ContractsPage.tsx": "Provides a UI for calling canister methods with Internet Identity authentication, currently simulating contract calls as a demo implementation.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard displaying total assets and individual token balances (InfinityCoin, ICP, ckBTC, ckETH, ckSOL) with Bitcoin deposit status and navigation props.",
  "frontend/src/pages/HistoryPage.tsx": "Displays transaction history with token filtering, showing locally recorded submissions with a disclaimer that actual balances are controlled by ICRC-1 ledgers.",
  "frontend/src/pages/ReceivePage.tsx": "React page component that displays user's Principal address for receiving ICRC-1 tokens (ICP, ckBTC, ckETH, ckSOL, Infinity Coin) and a native Bitcoin deposit address for receiving ckBTC, with copy-to-clipboard functionality and error handling for mainnet-only features.",
  "frontend/src/pages/SendPage.tsx": "React page component for sending tokens with multi-step form (form/confirm/success), supporting multiple token types (Infinity Coin, ICP, ckBTC, ckETH, ckSOL) and transfer modes (wrapped/native), including validation, balance checks, and transaction recording.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, extended utilities for glow/neon effects, custom fonts (Inter, JetBrains Mono), and container/responsive settings.",
  "project_state.json": "Project state file documenting known issues with ckBTC minter integration (missing 'get_btc_address' method, deposit status decoding error, agent configuration conflict) and tracking feature requests to resolve these issues."
}