{
  "backend/main.mo": "Main Motoko actor implementing a multi-coin wallet backend with transaction history, contacts, user profiles, balances vault, and access control using MixinAuthorization and AccessControl modules.",
  "feature_evidence.json": "Feature evidence report documenting UI component size reduction from large to medium scale across buttons, cards, inputs, and text elements with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, utilities, and configuration with details on authentication, validation, styling, and medium-scale UI adjustments.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color variables for light and dark themes, defining design tokens for background, foreground, borders, and component colors.",
  "frontend/index.html": "HTML entry point with viewport meta tag, title 'Infinity Wallet', root div, and module script loading main.tsx.",
  "frontend/SMOKE_TEST.md": "Smoke test checklist covering connection flow, profile setup, dashboard rendering, navigation, send/receive flows, contacts CRUD, and address format validation for post-deployment testing.",
  "frontend/src/App.tsx": "Main React app component managing Internet Identity authentication flow, profile setup dialog, page routing (dashboard/send/contacts/history/receive/contracts), loading states, and error handling with AppLayout wrapper.",
  "frontend/src/components/auth/AuthButton.tsx": "Medium-sized authentication button (h-7, text-xs) for Internet Identity sign-in/sign-out with loading spinner, error recovery, and query cache clearing on logout.",
  "frontend/src/components/auth/PrincipalDisplay.tsx": "Compact principal display component (text-xs, h-5 w-5 button) with optional truncation and copy-to-clipboard functionality with visual feedback.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog that prompts new users to enter their name to complete profile setup, with form validation and loading states.",
  "frontend/src/components/contacts/ContactEditorDialog.tsx": "Modal dialog for creating or editing contacts with name and address fields, including validation for ICP addresses and principals.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "React error boundary component that catches and displays application errors with a reload button and error details.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with header, navigation bar, and page routing for dashboard, send, receive, contacts, history, and contracts pages.",
  "frontend/src/components/layout/WalletLogo.tsx": "Displays the wallet logo image with gradient text overlay and the application name from branding configuration.",
  "frontend/src/components/wallet/BalanceCard.tsx": "Card component displaying token balance with icon, USD value, loading states, error handling, and manual refresh button.",
  "frontend/src/components/wallet/BitcoinDepositStatus.tsx": "Alert component that displays pending Bitcoin deposit status with refresh functionality when ckBTC minting is in progress.",
  "frontend/src/components/wallet/BitcoinFeeDisplay.tsx": "Alert component showing Bitcoin network fee information in satoshis and BTC, with processing time details for withdrawals.",
  "frontend/src/components/wallet/RecipientPicker.tsx": "Popover component with searchable contact list that allows users to select a recipient address from their saved contacts.",
  "frontend/src/components/wallet/TotalAssetsDisplay.tsx": "Displays total wallet assets across multiple tokens (Infinity Coin, ICP, ckBTC, ckETH, ckSOL) with selectable denomination (USD or any token), calculating values using exchange rates.",
  "frontend/src/components/wallet/TransferModeSelector.tsx": "Radio group component for selecting between wrapped (ICRC-1) and native Bitcoin transfer modes, showing speed and fee differences.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor with authentication, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useCkBtcBalance.ts": "Fetches ckBTC balance from the ICRC-1 ledger using the user's principal and default account, with comprehensive debug logging.",
  "frontend/src/hooks/useCkBtcDepositAddress.ts": "Queries the ckBTC minter to get the user's Bitcoin deposit address, handling mainnet-only availability and local development errors.",
  "frontend/src/hooks/useCkBtcDepositStatus.ts": "Checks for pending Bitcoin deposits by calling the minter's update_balance method, parsing UTXO statuses and confirmations.",
  "frontend/src/hooks/useCkBtcLedger.ts": "Creates and manages an authenticated ckBTC ICRC-1 ledger client, initializing it when identity is available with detailed logging.",
  "frontend/src/hooks/useCkBtcMinter.ts": "Creates and manages a ckBTC minter client instance based on the user's identity, handling initialization state.",
  "frontend/src/hooks/useCkBtcMinterInfo.ts": "Queries the ckBTC minter for configuration info (fees, limits, etc.) with 5-minute cache and retry logic.",
  "frontend/src/hooks/useCkBtcWithdraw.ts": "Mutation hook for withdrawing ckBTC to native Bitcoin addresses via the minter, invalidating balance and transaction queries on success.",
  "frontend/src/hooks/useCkBtcWithdrawalStatus.ts": "React Query hook that polls ckBTC withdrawal status by block index every 10 seconds until confirmed, using the ckBTC minter client.",
  "frontend/src/hooks/useCkEthBalance.ts": "React Query hook that fetches ckETH balance from the ICRC-1 ledger for the authenticated user's default account with extensive console logging for debugging.",
  "frontend/src/hooks/useCkEthLedger.ts": "React hook that initializes and manages an authenticated ckETH ICRC-1 ledger client based on Internet Identity authentication state with detailed logging.",
  "frontend/src/hooks/useCkSolBalance.ts": "React Query hook that fetches ckSOL balance from the ICRC-1 ledger for the authenticated user's default account with comprehensive debugging output.",
  "frontend/src/hooks/useCkSolLedger.ts": "React hook that creates and manages an authenticated ckSOL ICRC-1 ledger client tied to Internet Identity login status with extensive logging.",
  "frontend/src/hooks/useExchangeRates.ts": "React Query hook that fetches and parses exchange rates for ICP, ckBTC, ckETH, ckSOL, and Infinity Coin from ICPSwap API, converting ICP-denominated rates to USD.",
  "frontend/src/hooks/useIcpBalance.ts": "React Query hook that fetches ICP balance from the ICRC-1 ledger for the authenticated user's default account with detailed console debugging.",
  "frontend/src/hooks/useIcpLedger.ts": "React hook that initializes and maintains an authenticated ICP ICRC-1 ledger client synchronized with Internet Identity authentication state, including comprehensive logging.",
  "frontend/src/hooks/useInfinityCoinBalance.ts": "React Query hook that fetches the user's Infinity Coin balance from the ICRC-1 ledger, with extensive console logging for debugging identity, account construction, and balance fetch operations.",
  "frontend/src/hooks/useInfinityLedger.ts": "React hook that creates and manages an authenticated Infinity Coin ledger client, initializing it when identity is available and verifying actor methods with detailed logging.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useOisyActor.ts": "Empty file with no content.",
  "frontend/src/hooks/useOisyWallet.tsx": "Empty file with no content.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user profiles, transaction history, and contacts management, using the backend actor with mutations that invalidate queries and show toast notifications.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light/dark cosmic theme, neon glow utilities (cyan, purple, magenta), and animated starfield background effects.",
  "frontend/src/lib/branding.ts": "Exports application name and token symbol constants including ICP, ckBTC, ckETH, ckSOL, and Infinity Coin.",
  "frontend/src/lib/ckBtcLedger/client.ts": "ICRC-1 ledger client for ckBTC with TypeScript types, IDL factory, and authenticated actor creation using HttpAgent with comprehensive debugging logs.",
  "frontend/src/lib/ckBtcLedger/config.ts": "Exports the ckBTC ICRC-1 ledger canister ID constant as the single source of truth.",
  "frontend/src/lib/ckBtcLedger/index.ts": "Re-exports ckBTC ledger configuration, client creation functions, utility functions, and TypeScript types from the ckBtcLedger module.",
  "frontend/src/lib/ckBtcMinter/client.ts": "Defines TypeScript types and IDL factory for the ckBTC minter canister, providing interfaces for Bitcoin address generation, balance updates, BTC retrieval, and minter info queries.",
  "frontend/src/lib/ckBtcMinter/config.ts": "Exports the official ckBTC minter canister ID for mainnet.",
  "frontend/src/lib/ckBtcMinter/index.ts": "Re-exports all configuration and client functionality from the ckBtcMinter module.",
  "frontend/src/lib/ckEthLedger/client.ts": "Implements ICRC-1 ledger client for ckETH with comprehensive debugging, providing balance queries, transfers, and metadata functions using the Dfinity agent.",
  "frontend/src/lib/ckEthLedger/config.ts": "Exports the ckETH ICRC-1 ledger canister ID as the single source of truth.",
  "frontend/src/lib/ckEthLedger/index.ts": "Re-exports ckETH ledger configuration, client creation functions, and all ICRC-1 types.",
  "frontend/src/lib/ckSolLedger/client.ts": "Implements ICRC-1 ledger client for ckSOL with debugging support, mirroring the ckETH client structure for balance queries, transfers, and metadata.",
  "frontend/src/lib/ckSolLedger/config.ts": "Exports the ckSOL ICRC-1 ledger canister ID as the single source of truth.",
  "frontend/src/lib/ckSolLedger/index.ts": "Re-exports ckSOL ledger configuration, client creation functions, and all ICRC-1 types.",
  "frontend/src/lib/icpAccountId.ts": "Provides utility functions to derive ICP Ledger Account Identifiers from Principals using SHA-224 hashing and CRC32 checksums.",
  "frontend/src/lib/icpLedger/client.ts": "Implements ICRC-1 ledger client for ICP with debugging support, providing balance queries, transfers, fee queries, and metadata functions.",
  "frontend/src/lib/icpLedger/config.ts": "Exports the ICP ICRC-1 ledger canister ID as the single source of truth.",
  "frontend/src/lib/icpLedger/index.ts": "Re-exports ICP ledger configuration, client creation functions, and all ICRC-1 types.",
  "frontend/src/lib/infinityLedger/client.ts": "Defines ICRC-1 ledger client for Infinity Coin with TypeScript interfaces, IDL factory, and authenticated actor creation with comprehensive debugging and error handling.",
  "frontend/src/lib/infinityLedger/config.ts": "Exports the Infinity Coin ICRC-1 ledger canister ID as a single source of truth.",
  "frontend/src/lib/infinityLedger/index.ts": "Re-exports Infinity Coin ledger configuration, client functions, and TypeScript types for external consumption.",
  "frontend/src/lib/utils.ts": "Provides utility functions for CSS class merging, principal truncation, and timestamp formatting.",
  "frontend/src/lib/validation.ts": "Contains validation functions for ICP, Bitcoin, Ethereum, and Solana addresses, plus amount parsing and formatting utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/ContactsPage.tsx": "Displays and manages user contacts with add, edit, and delete functionality using dialogs and confirmation alerts.",
  "frontend/src/pages/ContractsPage.tsx": "Provides UI for calling canister methods with authentication check, form inputs for canister ID, method name, and JSON arguments.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard displaying total assets, individual token balances (Infinity Coin, ICP, ckBTC, ckETH, ckSOL) with USD values, and Bitcoin deposit status.",
  "frontend/src/pages/HistoryPage.tsx": "Transaction history page that displays filtered transaction records with token icons, supports filtering by token type, and includes refresh functionality with loading states.",
  "frontend/src/pages/ReceivePage.tsx": "Receive page displaying user's Principal address for ICRC-1 tokens and native Bitcoin deposit address with copy-to-clipboard functionality.",
  "frontend/src/pages/SendPage.tsx": "Send page implementing multi-token transfer functionality with wrapped/native mode selection, recipient validation, amount input, confirmation flow, and integration with multiple ledger hooks.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom font sizes, spacing scale, OKLCH color system with CSS variables, border radius, and typography/animation plugins.",
  "project_state.json": "Project state file tracking a feature request to reduce UI component sizes from large to medium across the application."
}