{
  "backend/main.mo": "Main actor implementing a multi-token wallet backend with transaction recording, contact management, user profiles, and access control. Supports five coin types (ICP, ckBTC, ckETH, ckSOL, InfinityCoin) with balances stored as 5-tuples and includes migration support.",
  "backend/migration.mo": "Migration module that upgrades the actor state from 2-coin support (ICP, InfinityCoin) to 5-coin support (adding ckBTC, ckETH, ckSOL), transforming balance tuples from 2 to 5 elements and updating transaction history types.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including ICRC-1 ledger clients for all tokens, React Query balance hooks, total assets display with denomination selector, multi-token balance cards, and transaction history filtering.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, hooks, pages, and utilities for the multi-token wallet with Internet Identity authentication, ICRC-1 ledger integration, and futuristic neon UI theme.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining colors for UI elements, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and root div mounting point, loading the main TypeScript module.",
  "frontend/SMOKE_TEST.md": "Manual smoke test checklist covering wallet connection, profile setup, dashboard rendering, navigation, send/receive flows, contacts CRUD, and address format validation for both ICP Account IDs and Principals.",
  "frontend/src/App.tsx": "Main application component that handles routing between pages (dashboard, send, contacts, history, receive, contracts), manages authentication state with Internet Identity, and conditionally renders profile setup dialog or login prompts.",
  "frontend/src/components/auth/AuthButton.tsx": "Authentication button component that toggles between sign-in and sign-out states, handles Internet Identity login/logout, and clears the query cache on logout.",
  "frontend/src/components/auth/PrincipalDisplay.tsx": "Displays the user's principal ID with optional truncation and copy-to-clipboard functionality in a styled card with visual feedback.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for first-time user profile setup that prompts for a name and saves it using the useSaveCallerUserProfile mutation hook.",
  "frontend/src/components/contacts/ContactEditorDialog.tsx": "Dialog component for adding or editing contacts with name and address fields, including validation for recipient addresses and save/update functionality.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "React error boundary component that catches and displays application errors with error details and a reload button.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper providing header with logo and auth controls, plus navigation bar with page buttons (dashboard, receive, send, contacts, history, contracts) visible when authenticated.",
  "frontend/src/components/layout/WalletLogo.tsx": "Displays the application logo image and name with gradient styling and glow effects.",
  "frontend/src/components/wallet/BalanceCard.tsx": "Card component displaying token balance with icon, loading states, error handling, and a refresh button with animation.",
  "frontend/src/components/wallet/RecipientPicker.tsx": "A popover component that displays a searchable list of contacts and allows selecting a recipient by their address. Uses the useGetContacts hook to fetch contacts and displays them with truncated principal addresses.",
  "frontend/src/components/wallet/TotalAssetsDisplay.tsx": "A card component that displays total asset balances across multiple tokens (InfinityCoin, ICP, ckBTC, ckETH, ckSOL) with a denomination currency selector. Currently shows the balance of the selected token without cross-token conversion.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and manages the backend actor instance based on the user's Internet Identity authentication state. Automatically invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useCkBtcBalance.ts": "A React Query hook that fetches the ckBTC balance from the ICRC-1 ledger for the authenticated user's default account. Includes comprehensive console logging for debugging balance fetch operations.",
  "frontend/src/hooks/useCkBtcLedger.ts": "A hook that initializes and manages an authenticated ckBTC ICRC-1 ledger client using the user's Internet Identity. Returns null when the user is not signed in and includes detailed logging for debugging.",
  "frontend/src/hooks/useCkEthBalance.ts": "A React Query hook that fetches the ckETH balance from the ICRC-1 ledger for the authenticated user's default account. Includes comprehensive console logging for debugging balance fetch operations.",
  "frontend/src/hooks/useCkEthLedger.ts": "A hook that initializes and manages an authenticated ckETH ICRC-1 ledger client using the user's Internet Identity. Returns null when the user is not signed in and includes detailed logging for debugging.",
  "frontend/src/hooks/useCkSolBalance.ts": "A React Query hook that fetches the ckSOL balance from the ICRC-1 ledger for the authenticated user's default account. Includes comprehensive console logging for debugging balance fetch operations.",
  "frontend/src/hooks/useCkSolLedger.ts": "React hook that creates and manages an authenticated ckSOL ICRC-1 ledger client using Internet Identity, with extensive console logging for debugging initialization and method verification.",
  "frontend/src/hooks/useIcpBalance.ts": "React Query hook that fetches ICP balance from the ICRC-1 ledger for the authenticated user's default account, with detailed logging of identity state, account construction, and balance fetch operations.",
  "frontend/src/hooks/useIcpLedger.ts": "React hook that creates and manages an authenticated ICP ICRC-1 ledger client using Internet Identity, with comprehensive debugging logs for initialization and actor method verification.",
  "frontend/src/hooks/useInfinityCoinBalance.ts": "React Query hook that fetches Infinity Coin balance from the ICRC-1 ledger for the authenticated user, with extensive logging for debugging account construction and balance retrieval.",
  "frontend/src/hooks/useInfinityLedger.ts": "React hook that initializes and manages an authenticated Infinity Coin ICRC-1 ledger client using Internet Identity, with detailed console logging for debugging client creation and method verification.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options for idle handling and derivation origins.",
  "frontend/src/hooks/useOisyActor.ts": "Empty file with no content.",
  "frontend/src/hooks/useOisyWallet.tsx": "Empty file with no content.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for managing user profiles, transaction history, and contacts through the backend actor, with mutations that invalidate relevant queries and display toast notifications on success/error.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a cosmic/neon theme (cyan, purple, magenta) for light and dark modes, plus utility classes for glow effects and animated starfield backgrounds.",
  "frontend/src/lib/branding.ts": "Exports branding constants for the application name ('Infinity Wallet') and supported token symbols (ICP, ckBTC, ckETH, ckSOL, Infinity Coin).",
  "frontend/src/lib/ckBtcLedger/client.ts": "Creates authenticated ICRC-1 ledger clients for ckBTC with comprehensive debugging, defining TypeScript interfaces for accounts, transfers, and errors, plus an IDL factory for the ledger service.",
  "frontend/src/lib/ckBtcLedger/config.ts": "Defines the ckBTC ICRC-1 ledger canister ID constant ('mxzaz-hqaaa-aaaar-qaada-cai').",
  "frontend/src/lib/ckBtcLedger/index.ts": "Re-exports ckBTC ledger configuration, client creation functions, and TypeScript types for external use.",
  "frontend/src/lib/ckEthLedger/client.ts": "Creates authenticated ICRC-1 ledger clients for ckETH with comprehensive debugging, defining TypeScript interfaces for accounts, transfers, and errors, plus an IDL factory for the ledger service.",
  "frontend/src/lib/ckEthLedger/config.ts": "Defines the ckETH ICRC-1 ledger canister ID constant ('ss2fx-dyaaa-aaaar-qacoq-cai').",
  "frontend/src/lib/ckEthLedger/index.ts": "Re-exports ckETH ledger configuration, client creation functions, and TypeScript types for external use.",
  "frontend/src/lib/ckSolLedger/client.ts": "Creates authenticated ICRC-1 ledger clients for ckSOL with comprehensive debugging, defining TypeScript interfaces for accounts, transfers, and errors, plus an IDL factory for the ledger service.",
  "frontend/src/lib/ckSolLedger/config.ts": "Defines the ckSOL ICRC-1 ledger canister ID constant ('zfcdd-tqaaa-aaaaq-aaaga-cai').",
  "frontend/src/lib/ckSolLedger/index.ts": "Re-exports ckSOL ledger configuration, client creation functions, and TypeScript types for external use.",
  "frontend/src/lib/icpAccountId.ts": "Implements ICP Ledger Account Identifier derivation from a Principal using SHA-224 hashing and CRC32 checksums with default subaccount, including custom SHA-224 and CRC32 implementations.",
  "frontend/src/lib/icpLedger/client.ts": "Defines ICRC-1 types and interfaces for ICP ledger interactions, including account, transfer arguments, errors, and results. Provides createIcpLedgerClient function to create an authenticated actor with comprehensive debugging and IDL factory for canister communication.",
  "frontend/src/lib/icpLedger/config.ts": "Exports the ICP ICRC-1 Ledger canister ID constant as the single source of truth.",
  "frontend/src/lib/icpLedger/index.ts": "Re-exports ICP ledger configuration, client functions, and TypeScript types for external consumption.",
  "frontend/src/lib/infinityLedger/client.ts": "Defines ICRC-1 types and interfaces for Infinity Coin ledger interactions, mirroring ICP ledger structure. Provides createInfinityLedgerClient function with debugging for authenticated actor creation.",
  "frontend/src/lib/infinityLedger/config.ts": "Exports the Infinity Coin ICRC-1 Ledger canister ID constant as the single source of truth.",
  "frontend/src/lib/infinityLedger/index.ts": "Re-exports Infinity Coin ledger configuration, client functions, and TypeScript types for external consumption.",
  "frontend/src/lib/utils.ts": "Provides utility functions: cn for className merging, truncatePrincipal for shortening principal strings, and formatTimestamp for converting bigint timestamps to readable dates.",
  "frontend/src/lib/validation.ts": "Provides validation functions for recipient addresses (hex Account IDs or Principals), amounts, and utilities for formatting balances and parsing amounts to e8s representation.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider and InternetIdentityProvider wrapping the main App component.",
  "frontend/src/pages/ContactsPage.tsx": "Displays and manages user contacts with add, edit, and delete functionality using React Query hooks and shadcn UI components with gradient styling.",
  "frontend/src/pages/ContractsPage.tsx": "Provides UI for calling canister methods with canister ID, method name, and JSON arguments, simulating contract calls with authentication check for Internet Identity.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page component that displays total assets and individual token balances (Infinity Coin, ICP, ckBTC, ckETH, ckSOL) using custom hooks and balance cards. Provides navigation to other wallet pages and refresh functionality for each token.",
  "frontend/src/pages/HistoryPage.tsx": "Transaction history page that displays locally recorded transaction submissions with filtering by token type. Shows transaction details including timestamp, recipient, amount, and token icons with refresh capability.",
  "frontend/src/pages/ReceivePage.tsx": "Receive tokens page that displays the user's Principal address for receiving ICRC-1 tokens. Shows supported tokens with copy-to-clipboard functionality and explains unified addressing across all token types.",
  "frontend/src/pages/SendPage.tsx": "Send tokens page with multi-step flow (form, confirm, success) supporting five token types. Handles recipient validation, amount parsing, ledger transfers, transaction recording, and error formatting for each token type.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing. Provides sessionStorage persistence for parameters and methods to clear sensitive data from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended typography, container queries, animations, custom font families (Inter, JetBrains Mono), and glow/neon shadow effects for a cosmic-themed UI.",
  "project_state.json": "Project state document defining a multi-token ICP wallet app supporting ICP, Infinity Coin, ckBTC, ckETH, ckSOL, and ckUSDT with features for balance viewing, transfers, total assets calculation, and ICRC-1 ledger client integration."
}