{
  "kind": "build_request",
  "title": "Revert to last known working version after failed deployment",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-26",
      "text": "Revert the application codebase (frontend + backend) to the most recent known-good version that successfully deployed, undoing the changes that led to the current deployment failure.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "just revert back"
        ]
      },
      "acceptanceCriteria": [
        "The codebase reflects the previous working version (no remaining changes from the failed deployment attempt).",
        "A full build and deploy completes successfully without errors.",
        "After deployment, the app loads and the authenticated Oisy Wallet flow renders without runtime errors."
      ]
    },
    {
      "id": "REQ-27",
      "text": "After reverting, run a smoke test of the primary user journeys to confirm the reverted build is functional: connect wallet, view Dashboard, navigate to Send, Receive, Contacts, History, and Contracts.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "just revert back"
        ]
      },
      "acceptanceCriteria": [
        "User can connect (or see the expected unavailable state) without the app crashing.",
        "Dashboard renders and navigation between pages works.",
        "Send form, Receive copy-to-clipboard, Contacts CRUD UI, History list, and Contracts form all render and are interactable (no uncaught exceptions in the console)."
      ]
    }
  ],
  "constraints": [
    "Respect the existing single-actor Motoko backend architecture (all Motoko logic stays in backend/main.mo).",
    "Do not edit files under frontend/src/components/ui or other frontend immutable paths; compose them instead if needed."
  ],
  "nonGoals": [
    "Implementing new features or UI redesign beyond what is required to restore the last working deployment.",
    "Refactoring unrelated code or changing data models unless required to restore deployability."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}