{
  "kind": "build_request",
  "title": "Update Infinity Wallet theme to match uploaded Infinity Coin logo (futuristic/digital)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-9",
      "text": "Update the Infinity Wallet visual theme to be futuristic and digitally appealing, using the uploaded Infinity Coin logo image (image.png) as the primary visual inspiration (color palette, glow/gradient style, typography, and overall UI feel), and apply it consistently across all existing screens (Dashboard, Send, Contacts, History) and the main layout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "i like this but my theme is going to be this picture logo of my coin. make it futuristic and digitally appealing."
        ]
      },
      "acceptanceCriteria": [
        "Theme tokens in frontend/index.css are updated to reflect a futuristic/digital style inspired by image.png (e.g., dark/space-like surfaces, neon accents, high-contrast text), while keeping UI readable and accessible.",
        "AppLayout header/navigation/footer and all page headers/cards/forms visually match the updated theme (consistent background, borders, radii, shadows/glows, and hover/focus states).",
        "No changes are made to any files under frontend/src/components/ui (compose them via props/classes only)."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Update the existing static branding assets so they visually match the uploaded Infinity Coin logo style (image.png), keeping filenames/paths compatible with the current UI usage.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "my theme is going to be this picture logo of my coin"
        ]
      },
      "acceptanceCriteria": [
        "The app header logo (used by frontend/src/components/layout/WalletLogo.tsx) renders the updated infinity-wallet-logo.dim_1024x1024.png without layout breakage.",
        "The Infinity Coin token icon (used on the Dashboard balance card) renders the updated infinity-coin-icon.dim_512x512.png and matches the futuristic/neon style.",
        "All images are served as static frontend assets (no backend image serving)."
      ]
    }
  ],
  "constraints": [
    "Respect the existing single-actor Motoko backend architecture; no backend changes are required for this request.",
    "Do not edit immutable frontend paths listed in SYSTEM_CONTEXT (including frontend/src/components/ui and auth/actor hooks).",
    "Keep existing image paths used in the UI working (e.g., /assets/generated/infinity-wallet-logo.dim_1024x1024.png and /assets/generated/infinity-coin-icon.dim_512x512.png)."
  ],
  "nonGoals": [
    "Adding new wallet features (e.g., Receive flow, real on-chain transfers) beyond visual/theme updates.",
    "Changing authentication behavior (Internet Identity) or backend data models."
  ],
  "imageRequirements": {
    "required": [],
    "edits": [
      "Restyle to match the uploaded Infinity Coin logo (image.png) with a futuristic neon/digital aesthetic (infinity-wallet-logo.dim_1024x1024.png > infinity-wallet-logo.dim_1024x1024.png)",
      "Restyle to match the uploaded Infinity Coin logo (image.png) with a futuristic neon/digital aesthetic (infinity-coin-icon.dim_512x512.png > infinity-coin-icon.dim_512x512.png)"
    ]
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Futuristic, digitally appealing UI theme based on the provided Infinity Coin logo image"
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}