{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix ckBTC wallet address generation",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix Principal serialization in useCkBtcDepositAddress hook to send proper Candid Principal type to ckBTC minter's get_btc_address method",
      "acceptanceCriteria": [
        "The ckBTC minter receives a properly formatted Candid Account type with a valid Principal",
        "Bitcoin deposit addresses are successfully generated when users navigate to the Receive page",
        "The 'Invalid opt principal argument' error no longer appears in the console",
        "Generated Bitcoin addresses are displayed correctly in the ReceivePage component"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useCkBtcDepositAddress.ts",
          "operation": "modify",
          "description": "Fix the Principal serialization issue where the Principal is being sent as a JSON object {\"__principal__\":\"...\"} instead of a proper Candid Principal type. Ensure the Account parameter passed to get_btc_address contains a Principal instance, not a serialized object. The owner field must be a Principal created via Principal.fromText() or obtained directly from the identity, and subaccount must be properly encoded as an optional array of numbers if provided."
        },
        {
          "path": "frontend/src/pages/ReceivePage.tsx",
          "operation": "modify",
          "description": "Verify that the Bitcoin deposit address display and error handling properly reflects the fixed Principal serialization. Ensure the retry button and loading states work correctly with the updated hook implementation."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Fix Principal serialization in useCkBtcDepositStatus hook to send proper Candid Principal type to ckBTC minter's update_balance method",
      "acceptanceCriteria": [
        "The update_balance method successfully processes deposit status checks",
        "Pending Bitcoin deposits are correctly detected and displayed in the BitcoinDepositStatus component",
        "The deposit status polling works without Principal encoding errors"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useCkBtcDepositStatus.ts",
          "operation": "modify",
          "description": "Fix the Principal serialization issue where the Principal is being sent as a JSON object instead of a proper Candid Principal type when calling update_balance. Ensure the Account parameter contains a Principal instance (not a serialized object) for the owner field, and that the subaccount is properly encoded as an optional array of numbers if needed."
        },
        {
          "path": "frontend/src/components/wallet/BitcoinDepositStatus.tsx",
          "operation": "modify",
          "description": "Verify that the pending deposit status display correctly reflects the fixed Principal serialization. Ensure the component properly handles loading states and displays deposit information when the update_balance call succeeds."
        }
      ]
    }
  ]
}