{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix subaccount field serialization for ICRC-1 balance queries",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix account object construction in useInfinityCoinBalance.ts to include subaccount field as optional array type",
      "acceptanceCriteria": [
        "The account object passed to icrc1_balance_of includes a subaccount field",
        "The subaccount field is typed as an optional array: either [] for default subaccount or [Uint8Array] for a specific subaccount",
        "Balance queries execute without the 'Record is missing key \"subaccount\"' error",
        "Console logs show the complete account structure including the subaccount field"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useInfinityCoinBalance.ts",
          "operation": "modify",
          "description": "Update the account object construction in the queryFn to explicitly include the subaccount field as an empty array [] for the default subaccount. Change the account object from { owner: identity.getPrincipal() } to { owner: identity.getPrincipal(), subaccount: [] } to match the ICRC-1 Account record structure with owner (Principal) and subaccount (opt blob) fields."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update InfinityLedgerClient Account type definition to match ICRC-1 specification",
      "acceptanceCriteria": [
        "The Account type in client.ts includes subaccount as an optional array field",
        "TypeScript type checking enforces the correct Account structure throughout the codebase",
        "All calls to ledger methods using Account objects compile without type errors"
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/infinityLedger/client.ts",
          "operation": "modify",
          "description": "Update the Account interface definition to include the subaccount field as an optional array type. Change the Account type from { owner: Principal } to { owner: Principal; subaccount: [] | [Uint8Array] } to properly represent the ICRC-1 opt blob type as a TypeScript discriminated union where [] represents None and [Uint8Array] represents Some(blob)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Verify and update ICRC1Account interface and all account construction code to consistently include subaccount field",
      "acceptanceCriteria": [
        "All ICRC-1 account objects constructed in the frontend include the subaccount field",
        "Default subaccount is represented as an empty array []",
        "The dashboard successfully displays the Infinity Coin balance for principal czivj-wu7yw-hn3tf-dhe5l-pfvm6-lgejr-fqsbk-bosb3-qfjte-pni7k-kqe",
        "No console errors related to missing subaccount field appear"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SendPage.tsx",
          "operation": "modify",
          "description": "Review all account object constructions in the SendPage component and ensure any account objects passed to ICRC-1 ledger methods (such as icrc1_transfer) include the subaccount field set to [] for default subaccount. Update the from account construction in transfer calls to use { owner: identity.getPrincipal(), subaccount: [] } format."
        },
        {
          "path": "frontend/src/pages/ReceivePage.tsx",
          "operation": "modify",
          "description": "Review the account display logic in ReceivePage and ensure any account-related information shown to users reflects the complete ICRC-1 Account structure with both owner and subaccount fields. Update any account object constructions or displays to consistently show the default subaccount as an empty array []."
        }
      ]
    }
  ]
}