{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix USD value display with extended decimal precision",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Modify TotalAssetsDisplay component to format USD values with 8-12 decimal places to show non-zero values for very small amounts",
      "acceptanceCriteria": [
        "Total Assets USD value displays with at least 8 decimal places",
        "Small token values (like 495.33682336 Infinity Coin) show a non-zero USD equivalent",
        "Formatting remains readable and does not use scientific notation"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/wallet/TotalAssetsDisplay.tsx",
          "operation": "modify",
          "description": "Update the USD value formatting logic to display 8-12 decimal places instead of the current 2 decimal places. Modify the calculation and display logic where total USD value is shown to use a format like toFixed(12) or a custom formatter that shows sufficient precision for very small values (e.g., values under $0.01 should show 12 decimals, values under $1 should show 8 decimals). Ensure the formatting does not use scientific notation and remains human-readable. The existing USD calculation logic using exchange rates and token balances should remain unchanged."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Apply extended decimal precision formatting to individual token balance USD values in BalanceCard component",
      "acceptanceCriteria": [
        "Individual token balance cards show USD values with extended decimal precision",
        "Formatting is consistent with TotalAssetsDisplay"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/wallet/BalanceCard.tsx",
          "operation": "modify",
          "description": "Update the USD value formatting in BalanceCard to match the extended decimal precision implemented in TotalAssetsDisplay (8-12 decimals). Modify the rendering logic where the optional usdValue prop is displayed to use the same formatting approach as REQ-1. Ensure consistency in how small USD amounts are displayed across both components, avoiding scientific notation and maintaining readability."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Fix the ckBTC deposit status decoding error 'Not a vector type' in useCkBtcDepositStatus hook",
      "acceptanceCriteria": [
        "ckBTC deposit status queries complete without decoding errors",
        "BitcoinDepositStatus component displays pending deposits correctly or remains hidden when no deposits exist"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useCkBtcDepositStatus.ts",
          "operation": "modify",
          "description": "Investigate and fix the 'Not a vector type' decoding error that occurs when querying deposit status from the ckBTC minter. Review the IDL type definitions and the response parsing logic to ensure the minter's get_btc_address response structure matches the expected type. The error suggests a type mismatch in how the response is being decoded. Check if the response format changed or if the IDL definition needs updating. Add proper error handling and type guards to gracefully handle unexpected response formats. Ensure the hook returns appropriate states (loading, error, no deposits) so BitcoinDepositStatus component can render correctly."
        },
        {
          "path": "frontend/src/lib/ckBtcMinter/client.ts",
          "operation": "modify",
          "description": "Review and fix the IDL factory definition for the ckBTC minter's get_btc_address method and related deposit status queries. Ensure the response type definitions match the actual minter canister interface. The 'Not a vector type' error suggests the IDL expects a vector but receives a different type. Verify the UTXOStatus and pending deposit response structures align with the official ckBTC minter interface. Update type definitions if necessary to resolve the decoding error."
        }
      ]
    }
  ]
}