{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore last known good frontend build and validate primary Oisy Wallet journeys",
  "requirements": [
    {
      "id": "REQ-26",
      "summary": "Restore the frontend code to the most recent known-good deployed version so the app loads and the authenticated Oisy Wallet flow renders without runtime errors.",
      "acceptanceCriteria": [
        "The codebase reflects the previous working version (no remaining changes from the failed deployment attempt).",
        "A full build and deploy completes successfully without errors.",
        "After deployment, the app loads and the authenticated Oisy Wallet flow renders without runtime errors."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Revert/align App-level gating (connecting/unavailable/unauthenticated/authenticated states, page switching, and profile-setup gating) to match the last known-good deployed version; ensure the Oisy Wallet authenticated flow and page rendering paths do not throw at runtime. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useOisyWallet.tsx",
          "operation": "modify",
          "description": "Revert/align the Oisy Wallet connection hook/provider to the last known-good deployed behavior, ensuring stable identity availability during connect/auto-reconnect and avoiding browser/crypto-related runtime issues that could break the authenticated render path. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Revert/align navigation rendering and connected-state UI to the last known-good deployed version so authenticated navigation reliably shows Dashboard/Send/Receive/Contacts/History/Contracts without crashes. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Revert/align React Query hooks usage and actor dependency gating to the last known-good deployed version (avoid firing queries/mutations before actor availability) to prevent runtime errors during authenticated flows. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/AuthButton.tsx",
          "operation": "modify",
          "description": "Revert/align connect/disconnect behavior and cache clearing to the last known-good deployed version to ensure clean transitions between disconnected and connected states. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/ProfileSetupDialog.tsx",
          "operation": "modify",
          "description": "Revert/align profile setup dialog open/close conditions and save behavior to the last known-good deployed version to prevent any blocking modal flash or crashes after authentication. This should remain consistent with the selected \"authorization\" component expectations for profile setup flows. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-27",
      "summary": "Add a repeatable smoke-test checklist and runtime safeguards to validate primary user journeys after revert (connect wallet, Dashboard, Send, Receive, Contacts, History, Contracts).",
      "acceptanceCriteria": [
        "User can connect (or see the expected unavailable state) without the app crashing.",
        "Dashboard renders and navigation between pages works.",
        "Send form, Receive copy-to-clipboard, Contacts CRUD UI, History list, and Contracts form all render and are interactable (no uncaught exceptions in the console)."
      ],
      "file_operations": [
        {
          "path": "frontend/SMOKE_TEST.md",
          "operation": "create",
          "description": "Create a concise smoke-test checklist covering the required journeys: connect (or unavailable state), Dashboard render + navigation, Send render/confirm/success UI path, Receive copy-to-clipboard, Contacts add/edit/delete UI flows, History list refresh, and Contracts form interactions; include steps to verify no uncaught console exceptions."
        },
        {
          "path": "frontend/src/components/errors/AppErrorBoundary.tsx",
          "operation": "create",
          "description": "Add an app-level React error boundary component to catch unexpected runtime errors and present a safe fallback UI instead of a blank screen; this supports smoke testing by making failures visible and non-fatal. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the new AppErrorBoundary around the authenticated application content (and optionally around the full app shell) so navigation across Dashboard/Send/Receive/Contacts/History/Contracts cannot hard-crash the whole app during smoke tests. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}